{
    "url": "https://www.acoustic.com/blog/understanding-customer-struggles-has-never-been-more-critical",
    "title": "Understanding customer struggles has never been more critical",
    "date": "Mar 27, 2020",
    "author": {
        "name": "Loren McDonald",
        "job": "Program Director, Marketing Research",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/52fe/52fece51-1ef9-4bae-b3cb-58e68dc4a78b.jpg?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "From ordering dinner via multiple apps (with no-contact delivery) to ordering groceries online and picking them up in a drive-through or having them delivered, a majority of customers are experiencing brands in an entirely new way because of “stay inside” orders to help flatten the curve of COVID-19 infections. And brands who previously didn’t have online ordering and delivery are scrambling to create or connect to interfaces that can meet increased demand and still provide excellent customer experiences.",
        "Often there are multiple parties involved in an order — think GrubHub or Postmates connecting to a Thai restaurant — and as a business you want to make sure the experience is seamless. If customers are frustrated by the user interface or ordering process, they’ll likely virtually walk away. It’s hard enough for a company to pivot to new or increased online ordering and if you don’t understand why your customer abandons the process, you’re leaving money on the table.",
        "Take my own online shopping experience last week. When California received the order to shelter in place, I knew one of the big challenges I’d face was how to get various supplies and a steady volume of Chardonnay and Zinfandel, especially because most of the stores in my area now had modified hours and/or switched to online order and delivery.",
        "After ordering a supply of paper towels online (thankfully, the 60 rolls of toilet paper I ordered had already arrived), I went further down the virtual road and tried to order some wine from my favorite nearby wine and spirits chain store. Because my wife and I shop here a few times a month, I’d already joined their loyalty program a few years ago. But as I went to place my first online order for home delivery, I was unable to add wine selections to my shopping cart. I got caught in an infinite loop where a pop-up kept requesting my address to see if delivery was available in my area. Finally, I decided to simply create an account, hoping that might fix things.",
        "It did. Sort of.",
        "During the account set up, the site asked for my loyalty member number, which I had to go find (fortunately it’s dynamically populated in the store’s promotional emails). The store probably should start the account creation process asking for your loyalty member number (if you have one), and pre-populate the form with data it had already collected. In this case, the company would tie your loyalty membership number to your mobile phone number. But I had to enter my mobile phone number twice — once during account setup and again at checkout. A good digital customer experience is one that’s easy and, if these weren’t unusual times, I would have been tempted to abandon my wine buying altogether.",
        "My online shopping experience would have gone more smoothly had the store encouraged me to open an online account shortly after joining the loyalty program. A welcome email series with simple account creation instructions and a time-limited incentive of free shipping or delivery for my first order might have done the trick. What a missed opportunity to convert me to an additional channel.",
        "Also, by leveraging our purchase frequency data the store could have recommended monthly home delivery of the wines my wife and I consistently purchase or recommend similar wines to try.",
        "It’s not too late to improve customer experiences, whether it’s my nearby wine shop or your company’s online store. By taking advantage of analytics tools that track anomalies and struggles, you can gain insight into your customers’ pain points — places in their journey where they battle your UI or coding or, worse still, completely abandon the path.",
        "With e-commerce ramping up while people stay at home, you don’t want an online struggle to damage your brand or send customers to a competitor. By understanding your web and mobile experience and why some customers abandon and others do not, you can make quick improvements and your customers will reward you not only with their loyalty but often with increased sales value. And they’ll have their wine."
    ]
}