{
    "url": "https://www.acoustic.com/blog/distributed-banking-optimizing-channels-for-deposit-growth",
    "title": "Distributed banking: optimizing channels for deposit growth",
    "date": "Feb 17, 2021",
    "author": {
        "name": "Vincent Re",
        "job": "Worldwide Financial Services Strategist",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/40eb/40eb80b2-8b90-42be-9f5e-a5c3dd75c3ef.png?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "Advancements in seamless digital experiences and open data ecosystems are unlocking new possibilities for customers to bank and borrow. A personal checking account can be opened within Google Pay.  A business bank account can be opened within Intuit QuickBooks. A small loan can be obtained with Upstart. A home loan can be obtained with Better Mortgage. Each possibility is powered by a technology specialist providing superior user experience while financial institutions support the back-end banking and loan funding.",
        "Banking is evolving to an approach quite similar to the distribution model of airline ticket sales. A seat on a carrier can be purchased in various channels such as third-party aggregator websites, bundled vacation packages, and first-party digital properties. Airlines optimize sales performance by balancing the distribution of bookings across channels, for which banking will need to adopt a similar strategy.",
        "New channels are emerging in distributed banking along with key advancements in enhancing the direct experience—and achieving excellence in distributed banking, with key partnerships and frictionless online engagement, will be crucial for financial firms to meet deposit and loan targets in the years to come.",
        "New channels to obtain retail deposits",
        "Expanding deposits is key to a bank’s success. Within retail banking, two great examples of the distributed banking opportunities available are Raisin and Google Plex. Each provider accelerates time-to-value in banking offerings and simplifies financial user experience.  ",
        "Raisin, based in Germany, enables banks to access a wider pool of fixed deposit holders and allows retail customers to obtain more competitive interest rates beyond national borders. A prospect sets up a Raisin account, including Know Your Customer verification, at the local version of the Raisin website (.ie, .fr, .nl). Raisin then simplifies cross-border fixed deposits growth by managing the entire customer engagement within the Raisin platform, enabling France customers to deposit into Slovakia, Ireland customers into Latvia, and The Netherlands customers into Italy. Raisin currently has 103 partner banks from over 30 countries across 8 marketplaces as of January 2021.",
        "Google Plex, to be launched sometime in 2021, will enable banks to obtain the augmented value of financial wellness insights that Google can provide while also acquiring new checking and savings account customers that directly engage within the Google Pay platform. Google Plex can analyze spending patterns, simplify opt-in to partner offers, and advise on savings goals. Google Pay users can open up a bank account within the mobile app and select during the sign-up process which bank will hold the user’s deposits. Citi and Stanford Federal Credit Union are the two initial launch partner banks, with another nine banks to go live thereafter.",
        "Empowering the SMB banking experience",
        "Supporting the specific needs of SMBs is crucial to deposit growth, especially given current economic conditions. Distributed banking through key partnerships with Intuit QuickBooks and Shopify present significant potential in unlocking ease of commerce, greatly enabling SMBs to navigate through business turbulence and build up deposits.",
        "Intuit QuickBooks launched QuickBooks Cash, enabling SMB customers to obtain improved cash insights by opening a business bank account within the online software, with deposits held by Green Dot Bank. Key advantages delivered by this partnership include instant invoice deposit, accelerating cash access from days to minutes, and AI-powered cash-flow analysis to improve clarity of business liquidity.",
        "Shopify will be launching Shopify Balance, in which an SMB can improve expense management with a business account powered by Stripe Treasury and deposits held by Evolve Bank. Shopify identified that 40% of its customers used the same bank account for personal and business management. Shopify Balance assists SMBs to more easily manage expenses by offering a separate account within its platform and a rewards program for business expenses to obtain greater operational savings.",
        "Delivering mobile excellence in direct engagement",
        "Direct banking still holds great importance in the distribution model, especially mobile banking. Making the right choices in shaping a bank’s mobile app experience, particularly the ease of account sign-up, is critical to long-term success.",
        "Various banks have taken the approach of having the mobile app as the only channel of which to open an account. Inquiring to open an account on the websites of neobanks Current and Revolut will direct prospects to provide a mobile number to receive a link to download the mobile app. Major bank Credit Suisse also takes the app-only sign up approach for its new bank, CSX, for which a website inquiry presents a prompt to app download links and a QR code.",
        "Banks should look to configure the optimal mix of in-house and external resources that will concurrently deliver seamless mobile-centric experience and improve operating efficiency.",
        "Moving forward",
        "In the future, achieving deposits targets will no longer be as dependent on the number of branches or ATMs. The robustness of distribution partners that provide augmented value to a customer’s financial needs, in combination with an exemplary direct mobile experience, will be crucial to success.",
        "Stay tuned for Part 2 of this article series which will focus on distributed banking for loans. "
    ]
}