{
    "url": "https://www.acoustic.com/blog/micro-moment-strategy",
    "title": "Micro-moment strategy",
    "date": "Oct 17, 2019",
    "author": {
        "name": "Alyssa Vitrano",
        "job": "Head of Brand and Creative"
    },
    "content": [
        "Listening to our clients’ challenges is something we think is crucial at Acoustic. Forrester has also recently been asking marketers what challenges they had in their UK marketing programs, so we invited Thomas Husson, VP, Principal Analyst at Forrester, to talk about what he’s been hearing.",
        "We know everyone ultimately needs to grow revenue, but today that’s done by delivering a better customer experience. With so many new channels, technologies, and touchpoints — chatbots, voice-based assistants, AI, AR, VR — it’s kind of impossible to be an expert in all of them and deliver consistently across channels. This new constant flow of interactions with your customers is requiring you to shift from traditional and static processes to segmentation that can be done on the fly.",
        "“What’s changed is the digital relationship that brands can create with customers,” Husson said. “Mobile has changed the game and expectations, causing us to shift from campaigns to moments.” And that’s where you need technology, so you can personalize the experience to benefit customers in real-time. Not always easy, but here are three things he said marketers can start doing to make that happen.",
        "1. “Reduce the cognitive load.”",
        "What you don’t want to happen is have a customer spend too much time navigating around to find the information or products they’re looking for. You need to be able to understand and anticipate how they’ll interact so they get the right information when they need it, reducing the cognitive load for them.",
        "You can get that context through data around location and time — and this is where mobile comes in. It’s the perfect way to execute in micro-moments where you can serve customers exactly when they need you. “The majority of brands aren’t implementing the right mobile tools,” said Husson, “so then it can be hard to execute.”",
        "One industry often getting it right is travel. Airlines like Ryan Air send a notification welcoming someone to their destination and asking about their journey when they land. The airline can segment based on a customer’s profile (if they’re a frequent flyer, if they’re landing at home or traveling) to further personalize messages. You need to get the right measurement in place, but it’s all about giving people a better moment to make them loyal to your brand.",
        "2. “Learn how to work side by side with robots.”",
        "In the UK, marketing budgets are expected to grow significantly and tech spend is expected to outpace services soon. But being able to execute well in micro-moments requires a different technology stack, one that enables you to shift away from traditional cross-channel campaigns with fixed segments to more reactive ones with microtargeting. “You need to predict customer needs to engage them,” Husson said. “So you need an evolution of your tech platform, activating the right data and connecting the systems of insight and engagement. It’s about assembling a different kind of solution.”",
        "Sometimes that all feels easier said than done, right? Not if you’re using AI, which is allowing marketers to accomplish things much more quickly and see better results. “AI will create new jobs and change the way we work so we will have to learn how to work side by side with robots,” Husson explained. “AI will be more than just an assistant. It will help and enable you to focus on what really matters: creativity, strategy.” At Acoustic, we already have AI embedded into our products. Robots may be a playful way to look at it, but as our CEO Mark Simpson said at the event, we actually believe the best AI is one you don’t even know is there. It’s just helping you achieve better-than-ever personalization, planning, and automation without you even seeing how it works.",
        "One helpful piece of advice from Husson was that you can’t leapfrog directly to AI. You need to clean your data because, as Husson reminded everyone, “garbage in, garbage out.” Better data is key to personalizing experiences across channels, letting you have a dialogue with your customers instead of just talking at them.",
        "3. “Equip teams to shift from campaigns to moments.”",
        "So now that you have all your data, your teams need to be able to dig into it. The technology will take care of part of that, but you also need to prep everyone to use it more masterfully.",
        "One great example Husson gave was a gas and energy company with over 5 million customers. They’d been struggling to deliver valuable, consistent experiences across channels, and were just starting conversations over and over. So they prioritized 10 journeys for their teams to go deep and analyze, connecting over 70 legacy systems and figuring out how many channels were required to solve their customer’s problem. Finding that 80% of people were using only 20% of the features, it was clear they didn’t have the right data and process in place for their teams to respond quickly. They created a cross-functional team and a new process, really changing the mindset of the organization to make the most of their platform’s features and have a more data-driven culture.",
        "That kind of culture and a holistic platform will let your teams activate data better in the moment across all of your many touchpoints. And ultimately, that’s what empowers you to create the better experience your customers expect, exactly when they want it."
    ]
}