{
    "url": "https://www.acoustic.com/blog/brilliance",
    "title": "Brilliance",
    "date": "Jul 15, 2020",
    "author": {
        "name": "Mark Simpson",
        "job": "Chief Strategy Officer"
    },
    "content": [
        "Brilliance.",
        "Everyone is capable of it. It’s just that we don’t always have the right environment to access it.",
        "Whenever you start something new you tend to dream about what you’ll be able to achieve. When we sat down to think about who we wanted to be as a brand, we felt a huge sense of freedom to dream again, to experiment with new ideas, to improve the way marketers do their work—the freedom to go for brilliance. We knew we wanted to be a brand that would help everyone do that. And we knew we needed to listen to what each person needs and figure out how we can serve them best.",
        "Acoustic is the science of sound. It creates environments that draw people in through closer and more personal connections. And that’s what the best marketing does: as we know, it’s an art and a science. We’re Acoustic because we listen and understand the human dynamics of problems to find solutions that make a difference.",
        "What we’re hearing",
        "If you listen to marketers, you’ll hear that mediocrity is running rampant in our industry. Current solutions are mediocre at best—clunky, disjointed and too complicated. Data can be a sinkhole, different tools can present you with contradictory views, and people barely have time to grab lunch much less be creative anymore. Any spark of new thinking can easily get blown out by process and overwhelming data, and people start to settle for ordinary. We’re changing that. Our technology is helping them engage more quickly and easily, get better results, and create more personal connections with their customers—“get back to the good stuff,” as one client recently described it. And at Acoustic, our new independence gives us the agility and focus our competitors don’t have. We’re able to invest in technology that solves marketers’ specific needs and we’ll be able to help our clients find more creative ways to make themselves heard.",
        "If you listen to many teams, you’ll often hear a kind of apathy start to set in too. It can take forever to get approvals, fix a line of code, or even just commute to the office. They can also let the spark get stamped out. Instead of getting beaten down by all this, we’re going to listen to our company’s challenges and pivot to solutions that help all of us do our jobs and serve our clients better. Who wants to get up every day and do something mediocre? Everyone can get to brilliant when you have the freedom to do things differently and people to support you. Our teams will be more collaborative, our processes will be simplified, and our office spaces will be inspiring.",
        "If you listen to the industry, you’ve probably heard Chief MarTech’s Scott Brinker say there are now over 7,000 providers in our space. So our visual identity is unlike anything we’ve seen in this space—for a reason. Our goal is to differentiate from the rest by bringing warmth and humanity back to marketing, and this pervades every part of our Acoustic brand:",
        "Font: When we looked at our industry, it was a sea of the same flat font. Our italic, serif font brings in more personality and warmth.\n\t Colors: They’re not primary colors on a white background, like many other tech companies have these days. We have warmer blues and brilliant greens that really show who we are.\n\t Visual language: We use simple geometric shapes—circles and squares that reflect the interplay of art and science, of humanity and technology. Lots of the shapes intentionally overlap (like our very cool “a” icon) to show how this interconnection creates brightly colored moments of brilliance. Even our photos often have brilliant green circles framing a person, to represent their inner brilliance.\n\t Product and Solution Icons: Each product and solution has its own individual icon and even this is purposeful, representing what they help marketers achieve.\n\t Product Names: We’ve simplified them to reflect the primary challenge that each product solves. We don’t make product name changes lightly. This is a thoughtful decision so we can tightly align with our mission to make our products easy to use and simple to understand.\n\tThe Acoustic Marketing Cloud resembles the marketing solutions as a whole—an entirely modern, cloud-based suite of robust marketing tools designed to help marketers do their best work.\n\t\tAcoustic Campaign (formerly Campaign Automation)Acoustic Experience Analytics (formerly Tealeaf)Acoustic Content (formerly Content Hub)Acoustic Personalization (formerly Real-Time Personalization)Acoustic AnalyticsAcoustic Exchange (formerly Universal Behavior Exchange)\n\t\t\n\t",
        "Now, let’s have some fun!",
        "We’ll be having a “Welcome to Acoustic” webinar soon, where we’ll walk you all through our brand, new ways to work with us, and more details on the future of our products. ",
        "Follow @GoAcoustic on LinkedIn, Twitter, Facebook, Instagram, and YouTube and use #GoAcoustic.",
        "Acoustic playlist: Turn it up. We’ve got cool tracks submitted by our whole team here.",
        "Marketing and advertising can be better. We’re Acoustic because we now have the ability to listen with more focus and do things differently. Acoustic will create products and a culture that help everyone transcend the ordinary and do our best work.",
        "Because we are dreamers. We are hustlers. We are brilliant.",
        "We are Acoustic."
    ]
}