{
    "url": "https://www.acoustic.com/blog/virtual-events-dont-have-to-be-second-best",
    "title": "Virtual Events Don’t Have to be Second-Best",
    "date": "Aug 17, 2020",
    "author": {
        "name": "Nagham Hilly",
        "job": "Global Conferences &amp; Field Marketing",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/dd68/dd6898f2-e4ac-4993-ac01-87c7d36b231d.jpg?resize=220px%3A258px&crop=220%3A220%3B0%2C19"
    },
    "content": [
        "We had big plans. On the first anniversary of our status as a standalone company, we had endeavored to bring our global employee base together for a sales & marketing kick-off. We had been plotting since our company launch in July 2019 to celebrate the formal completion of our carve-out in June 2020 with a team-building event worthy of all of the hard work that went into standing up a global organization. Of course, in July 2019 we never could have predicted a global pandemic that would sideline large, in-person events indefinitely by the following summer.",
        "We were forced to pivot, and to do so quickly. We’re proud to say we were able to replicate the drama and significance of a “main stage,” high-end, in-person production entirely virtually in July 2020. We did so with a small budget—and our employees, who could have easily been emboldened to complain via an anonymous post-event survey, gave us rave reviews.",
        "What did we learn through our experience planning Acoustic Go that we’d love to share with our fellow marketers? Read on!",
        "It’s all about the tools",
        "Before you even think about event programming, consider the technology you will need to deliver a supreme event. At the most basic level, determine:",
        "How many people do you need to communicate to? Some video conferencing tools have limits depending upon the tier of your subscription. It’s best to figure this out early on so you start building your event around a tool that meets your audience requirements. We went through a few different options before we found the right solutions that aligned with our needs.Do you want to enable two-way communication? Pure live-streaming solutions don’t necessarily allow your audience to engage and interact with you. If you’re hoping for a two-way Q&A, for example, then a one-way channel won’t suffice.Do you want a combination of both? Perhaps your keynote presentations should be “one way” but break-out sessions should be more interactive. In that case, you may want to rely upon multiple tools, selecting ones that best align for specific session needs. But it’s critically important that you communicate well with attendees so they know exactly what tool to access, and when. We updated attendees daily with log-in details via both email and a dedicated Slack channel, added log-in details to calendar invitations, and included session links on our event website.",
        "Videoconferencing and virtual events tools are evolving in real-time, so it’s important to check to see what works and continue to iterate until close to the event. Don’t make assumptions about using a tool even six months prior—the landscape and functionality might change.",
        "Ultimately, we went with a combination of tools:",
        "Microsoft Teams Live for our Day 1 “Town Hall event, which included pre-produced content and “one to many” sharing of information. Teams Live allows you to invite up to 10,000 people to an event. We had 800 employees participate live during this session, with others viewing on-demand the following day.We used Zoom for our remaining sessions; though Acoustic’s default tool is typically Microsoft Teams, we needed to ensure all of our sales and marketing staff could participate, and Teams maxes out at 300.We used Microsoft Teams for smaller group breakouts as well as for “Office Hours” sessions, where our senior executives who presented at the kick-off held open Q&As with members of the team. These smaller forums complemented the large group content.",
        "Ask for help",
        "We used the majority of our out-of-pocket budget on our event production agency. We relied upon their expertise to produce a highly professionally Day 1 event. It set the tone for a successful ongoing program. We also learned from the professionals and used that knowledge to create terrific experiences for attendees for the remaining sessions. Our agency also helped us to create a consistent look and feel across presentations, virtual background settings, swag (yes, we sent packages to hundreds of home addresses), and more. Another engaging element: we worked with our partner to include pre-recorded sessions as well as post-production elements such as live Q&A. We brought in experts, too—industry analysts and formal professional training from experts. We wanted people to walk away feeling as though they learned a lot, were entertained, and derived measurable value from their participation.",
        "Train, rehearse, train, rehearse. Repeat.",
        "We worked with with our existing PR agency team to create a robust online presentation training program for all of our executives with speaking roles. We hosted both a group training session and individual sessions for all. This preparation really mattered, and it showed. The effort ensured that all presenters were focused on key delivery tactics in a virtual environment, including flow between presenters. Rehearsals are even more important for a virtual event than they are for an in-person event (though they’re always important!). Make certain that nobody thinks they can simply read a script because they’re able to hide behind a screen. In fact, we did away with slides almost entirely and created conversational programming to heighten engagement.",
        "Split it up, and choose an MC",
        "When you’re transitioning from a real-life event to a virtual one, there’s an immediate inclination to replicate the timing of the real-world event. For instance, if you planned for two full days in-person, simply do the same in a virtual setting. No—don’t do that to your attendees! We had planned for a two-and-a-half day in-person session. In a virtual world, we spread out our programming over five days that spanned two weeks. This allowed for our team to share a tremendous amount of content, but it also allowed for people to manage their to-do lists and navigate the complexities of our remote, work-from-home environment without feeling fully overwhelmed by the event commitment.",
        "We chose a host for each day of sessions. A singular point-of-contact to move attendees through the day and recap key points resonated well with our team.",
        "Have some fun",
        "Our corporate values are “grit, play, and care.” Because our virtual session was focused on planning for the year ahead, we had grit covered. So, we focused on “play and care” for what we deemed “ancillary events.” Here’s what we did:",
        "We worked with a professional music company that matches musicians with corporate gigs. We had several sessions with musicians with serious credentials—from Nashville to Broadway—and they actually helped us write an Acoustic anthem, a rallying cry to which all employees contributed lyrics.We also included the incredibly talented teenage son of one of our product managers; a piano virtuoso, he regaled us with the classics and the hits alike during session breaks in exchange for contributions to his virtual tip jar.We worked with a fitness studio to create a curated group of fitness and meditation classes. We created specific breaks for attendees to engage in movement—but, we also created an on-demand library of the workouts and meditation so that our employees could access the content at their convenience for the entirety of the two weeks that our kick-off lasted.",
        "Ask for feedback—and lots of it",
        "We sent out surveys daily. We used the feedback to improve in real-time. For example, after the first day, we realized that we needed to post session recordings to a shared site more quickly so that our colleagues in Asia could view the content they missed overnight as soon as possible. Trial and error and transparency about any missteps—as always—are key to a successful program.",
        "We were thrilled with the outcome of our very first virtual, global sales & marketing kick-off. In our case, we just happened to begin our virtual event programming with our employees. This “safe space”—though filled with a vocal audience—gave us the experience and expertise we needed to pursue additional virtual events. We’re excited to continue to engage with employees in this manner, but also to extend these unique experiences to our customers, prospects, and partners.",
        "In our last EOD survey during the kick-off, we asked employees if they would prefer in-person or virtual settings in the future. In-person still takes the cake—but participants were impressed with the quality of the virtual setting. We’ll take it.",
        "Events remain a vital component of the marketing mix",
        "Whether live or virtual, events remain an incredibly powerful platform. We hope our experience can inspire other marketers to embark on virtual conferences. To ensure success, we believe:",
        "Communication is key. It’s important to rely upon an email marketing platform such as Acoustic Campaign to promote the event—and gain attendees—and also to measure engagement for pre and post-event messaging.Balance creativity with technology. An outcome of COVID-19 is that we all have become used to informality in professional settings. You can mix high production with low production to create compelling programming and deliver an effective, inspiring event."
    ]
}