{
    "url": "https://www.acoustic.com/blog/accelerating-auto-insurance-claims",
    "title": "Accelerating auto insurance claims",
    "date": "Oct 7, 2020",
    "author": {
        "name": "Vincent Re",
        "job": "Worldwide Financial Services Strategist",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/40eb/40eb80b2-8b90-42be-9f5e-a5c3dd75c3ef.png?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "Mobile innovation in the past decade provided insurance companies with the ability to empower customers with easy access to account management and filing claims. An individual who gets into an unfortunate auto accident can open up the insurance firm’s mobile app, upload photos, and begin the process. The ease of front-end access in filing a claim hasn’t kept pace with the back-end processes of analyzing, approving, and paying claims, though. Claims processing often takes weeks to complete and involves multiple phone calls to gather additional information throughout the cycle.",
        "A recent New York Times analysis highlights a new ambitious reality now achievable for many insurance companies with the proper technology investments: customers can receive a ‘claim estimate before the tow truck is called’ when the First Notice of Loss is filed. Auto claims that insurers can approve quickly—while concurrently improving risk management—benefit customers and insurers through faster payments and more competitive rates. Innovations in mobile, AI, and data management are enabling insurance firms worldwide to verify low-risk claims without the need for phone calls, driving significant productivity improvements.",
        "Telematics for insurance claims",
        "Telematics, in-vehicle telecommunications technology powered by a plug-in device or mobile app that measures driving behavior, have usually been an exclusive area for offering pricing discounts. Sign up for a policy, download the app, opt-in to telematics to measure driving capabilities, and gain access to specific discounts according to usage-based insurance. Insurtech startup Root has taken pricing benefits one step further by making usage-based insurance a key part of its customer acquisition model, offering initial pricing based on using the app for a period of time to calculate a competitive rate for safe driving.",
        "Telematics is now making the natural crossover to First Notice of Loss in the insurance claims process. USAA recently launched an adjuster portal to incorporate telematics into the analysis. The initial phase enables an adjuster, upon a customer’s permission, to access telematics stats from the SafePilot mobile app to valid claims. The second phase, in due time, will provide crash-prediction analysis, a major move that if successful would signify substantial progress towards USAA’s stated goal of contactless claims experiences.",
        "Zurich Insurance’s U.K. division has some great success utilizing telematics for another major aspect of the claims process: preventing fraud incidents. Zurich thwarted a fraudulent claim against a Zurich policyholder by utilizing the black box telematics to identify that the car had been moving too slowly for whiplash to occur in the other vehicle. Zurich submitted a technical report in partnership with UK telematics insurance business Carrot and the claim was dropped, stopping insurance fraud and saving £10,000-£15,000 through avoidance of a false payout.  ",
        "Questions to consider:",
        "What are your firm’s plans and timelines to integrating telematics into the claims process?To what extent does your firm utilize mobile experience analytics to understand the success and struggle points of telematics in claims experiences?How will your firm manage opt-ins /opt-out user permissions to incorporate telematics data into claims processes and notification procedures?",
        "Visual recognition powered by AI",
        "The New York Times analysis on increasing claims productivity is centered on AI visual recognition, particularly on the friction involved in cost estimates for car repairs. Actual cost estimates once reviewed by a repair shop could be 50% higher compared to initial photo estimates by an adjuster. It’s a suboptimal experience for all parties involved – customer, repair shop, insurer – and the inaccuracies can jeopardize brand trust.",
        "Tractable, an insurtech startup based in the U.K., has been working with insurers such as Admiral Seguros in Europe and Tokio Marine in Asia to utilize its AI visual recognition to provide more accurate cost estimates. Tractable analyzed 10 million images of car photos in a variety of accident conditions – inclement weather, limited lighting, extent of damage – to identify specific car parts and provide more accurate estimates. The increasing sophistication of car parts – such as bumpers with sensors – can provide a wider variance, so it’s imperative to determine the correct bumper.",
        "Some insurance companies have taken the approach of developing in-house AI capabilities for visual recognition. There are unfortunate situations in which a car is beyond repair, though sometimes the actual determination can be more nuanced. The State Farm technology team removed days from its settlement times by bypassing the need for a physical inspection and utilizing AI analysis from First Notice of Loss to identify that a car can be marked as a total loss.",
        "Questions to consider:",
        "To what extent has your insurance firm been successful with visual recognition projects?Should your firm build, buy, or partner with AI visual recognition specialists to accelerate claims processes?How can your insurance firm provide the optimal digital experience to customers and adjusters in benefiting from AI visual recognition?",
        "Improving data quality",
        "Sometimes innovation can be as simple as better data management. Assured, a newly launched insurtech startup, enables potential insurance clients to provide customers with a guided app experience at First Notice of Loss that can provide over 8 million different user flows with multi-choice questions and zero text fields (no unstructured data) to optimize for any given claim situation.",
        "Assured also improves data quality by combining easy access to over 50 external data sources – weather, traffic, satellite data – so adjusters can quickly add additional context to claimant input and verify details. Overall, this can improve the efficiency of adjusters by reviewing many more claims per day with reduced time to compile relevant and accurate information.",
        "Questions to consider:",
        "What’s the current mobile and call center experience of a customer filing a claim and to what extent is unstructured data utilized in the process?What is the level of ease (or difficulty) of integrating external data sources into your firm’s current claims processes?To what extent can the claims team utilize data management best practices from marketing and digital commerce teams to integrate external data sources?",
        "Determining new risk benchmarks ",
        "The margin of success in accelerating auto claims processing is based on how many additional approvals could be deemed as low-risk and how many more fraudulent cases can be prevented with greater, more immediate access to relevant data.",
        "Consider in your firm’s roadmap what this difference could be when implementing new mobile, AI, and data management technologies based on the examples above. Evaluate if your firm has the appropriate experience analytics and marketing automation solutions in place to complement innovation initiatives and optimize risk benchmarks. Connect with me on LinkedIn to discuss directly."
    ]
}