{
    "url": "https://www.acoustic.com/blog/acoustic-holiday-benchmark-2020",
    "title": "Acoustic Holiday Benchmark 2020",
    "date": "Dec 4, 2020",
    "author": {
        "name": "Melissa Tatoris",
        "job": "Chief Innovation Catalyst",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/f97d/f97d24f4-f68f-4d2b-8144-837fd38ecb22.jpeg?resize=220px%3A293px&crop=220%3A220%3B0%2C37"
    },
    "content": [
        "It’s been widely reported that this Black Friday broke records in North America. It was the earliest start to a holiday season ever; retail stores began to set up for holiday sales the week prior to Halloween (one week to 10 days earlier than in the past). This early preparation—coupled with consumers’ desire to enjoy some semblance of a festive season—seems to be paying off.  The results we’ve seen so far represent a bright light for retailers eager to enjoy some financial recovery in Q4.",
        "At Acoustic, we analyzed the holiday campaign efforts of our customers throughout the month of November. What did we learn?",
        "The U.S. and Canada are most active (not surprisingly)",
        "North America represented more than half of the total global email volume during the month of November. The retail category was responsible for more than two-thirds of the total send volume during that period.",
        "",
        "Consumers were eager to shop early",
        "Our data indicates consumers were excited to get an early start on their holiday shopping. Our customers’ emails sent via Acoustic Campaign saw stronger open rates leading up to Black Friday than they did on Black Friday or Cyber Monday.",
        "",
        "In the U.S., Thanksgiving itself showed a 1.6% increase in open rates vs. Black Friday and the following Saturday. We can surmise this is due to lockdowns, strong guidance to stay home and socially distance and the result: less people to cook for and more screen time.",
        "SMS is gaining in popularity",
        "We saw significant year-over-year activity in the SMS category. Brands are leveraging SMS to drive loyalty, share incentives, deliver transactional messages, delivery messages, and more. Our data shows major SMS growth on Black Friday both in North America and across the globe. Curbside pick-up and home delivery are becoming fundamental to helping retailers grow their SMS files, which seemed to be a bit of a challenge prior to this holiday period.",
        "",
        " ",
        "",
        "What should marketers at retailers be focused on throughout December?",
        "\n Collect, read, analyze, and gain insights into your data. If you are not collecting and using your customer experience data (both online and in-store) you are not setting your brand up for future success.\n Watch your response data closely. If you have emails that are getting stronger open rates as well as click through rates – set them up as automated. This will not only drive more revenue, but lighten the load for your team, and make your resources run more efficiently.\n Bring all response data into your campaign tool, so you can get a true analysis of every channel you are using. And if your campaign tool doesn’t allow this, Acoustic can help.\n",
        "This is only the beginning. We’ll continue to assess our platform data throughout December. Watch this space for more insights."
    ]
}