{
    "url": "https://www.acoustic.com/blog/let-your-cms-lead-you-into-the-future",
    "title": "Let your CMS lead you into the future",
    "date": "May 1, 2020",
    "author": {
        "name": "Ankush Singla",
        "job": "Product",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/e986/e98609de-1a08-423e-a4d4-4b0847054f4b.jpg?resize=220px%3A293px&crop=220%3A220%3B0%2C37"
    },
    "content": [
        "Let’s be honest – despite our best efforts and hopes, no one knows what’s going to happen next. So from a marketer’s perspective, you need plans that can accommodate a variety of situations. These plans almost always include being able to quickly find, access, and reuse relevant content across your digital channels. To be effective, your marketing and development teams need tools that allow them to create or repurpose assets, content, code, and templates, all while ensuring your messaging is consistent across all touchpoints. As you think about what content solutions you have and what else you might need, we’ve put together four guidelines to inform your checklist and help you be better prepared for the future – and the unknown.",
        "Invest in a modern Content Management System (CMS) so you can navigate both growth and unpredictability. Every company has targets. But when things change – for better or for worse – you need to be able to react. The COVID-19 pandemic has led to a bunch of interesting case studies. Some large companies experienced 200% increases in digital traffic, while others experienced 40% decreases. If channel traffic decreases, you need to be able to quickly reallocate resources to the channels that allow you to most successfully meet your targets. And if it’s a huge increase, you don’t want your technology to make people wait for an image or page to load which could prevent you from exceeding your targets. A modern CMS lets you manage all your omnichannel content in one place and handles all of that scaling stuff for you. Modern technology should empower you, not hold you back. That includes martech.",
        "When designing content across your digital touchpoints, think ahead. With over 8,000 martech solutions available today, there’s really no excuse to not design for an omnichannel experience, even if you don’t plan to execute on that vision right away. This includes thinking about where reusing content can be strategic across your current channels, but also considering how it can adapt to channels you may use in the future. Chatbots were the new thing a couple years ago, but how many companies planned to build skills for voice assistants like the Echo?",
        "It’s also important to think through what you might need to support your customers in the future. It’s better to have planned for an event that didn’t occur than to not have a plan for one that did. This means building frameworks into your digital touchpoints to ensure timely responses to market dynamics, while maintaining content consistency through strategic reuse across all of your digital channels. It isn’t easy, but to effectively plan for the future, it’s paramount. You can’t plan for everything, but you can position yourself to react quickly.",
        "Figure out how quickly you need to respond to your customers in any situation, and select technology that enables you to achieve that goal. We all know response requirements vary across industries. In many B2C industries, you need to respond to events in real time. B2B industries tend to require slightly slower response times. As you’re selecting tools, have a requirement or two around the maximum response time your business will tolerate to get a page up on your site and mobile app, an email or SMS sent to each customer, or your digital ads updated. It’ll help you prevent unexpected surprises in the future. Here’s something to consider: How much more quickly could you speak to your customers if your CMS was tightly integrated with your campaign automation tool? If your email marketer can select the exact same image or block of text that you’ve used in your website and your mobile app, your response times get much quicker while reducing the likelihood of brand-impacting errors.",
        "Make sure you’re not getting in your own way. No matter how fast you’re moving, there’s no excuse for hurting your brand. Being timely is important. Consistent messaging is important. And maintaining your customers’ trust is even more important. That’s why you need to select technology that plays well with others — in other words, technology that focuses on an open ecosystem. Marketers use more tools to get their job done than ever before. Why add one that doesn’t work with the rest?\n\nFinally, your marketers and developers are equally important to consider when selecting your tools. They’re the ones that benefit most when you do the upfront work, like maximizing content reuse across channels. The more upfront work you can do, the more you can focus your efforts on strategy rather than worrying that your tactics might not be executed well.",
        "When selecting your marketing technology, keep the future in mind. The best technology enables your marketers and developers – you know, the people that make your marketing team function – to work together and frees them to do their best work, especially when you need it most.",
        "If you want to learn more about how a CMS can push your marketing to the next level, register for our webinar here."
    ]
}