{
    "url": "https://www.acoustic.com/blog/unleashing-pet-insurance-growth",
    "title": "Unleashing pet insurance growth",
    "date": "Nov 24, 2020",
    "author": {
        "name": "Vincent Re",
        "job": "Worldwide Financial Services Strategist",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/40eb/40eb80b2-8b90-42be-9f5e-a5c3dd75c3ef.png?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "Insurers (and their marketers) need look no further than their furry best friends when evaluating new avenues for innovation.",
        "Consider the fact that the purchase of pet insurance for cats and dogs in the U.S. market has been limited compared to other nations. For example, the North American Pet Health Insurance Association noted in its annual State of the Industry Report that approximately 2.09 million dogs and 427,000 cats were insured in the U.S. in 2019. The American Pet Products Association observed in its 2019-2020 National Pet Owners Survey that 63.4 million households have a dog and 42.7 million households have a cat. Even with an oversimplified calculation that each of those households only has one cat or one dog, the percentage of dogs with pet insurance is 3.3% and for cats the rate is merely 1% for U.S. pets in 2019. Compared to the rest of the world, U.S. pets are under-insured. In fact, 2019 data from the National Association of Insurance Commissioners highlights that 25-30% of cats and dogs are insured in the U.K. and 60-70% of pets are insured in Sweden.",
        "Established companies and new startups alike are looking to capture the growth for pet insurance premiums. Last year saw a 24.3% premium growth for the U.S. pet insurance market to a total of $1.56 billion. There could be significant potential on the horizon if the momentum in the U.S. continues and especially if the U.S. matches pet insurance rates with the U.K. and Sweden.",
        "Here are how some companies are approaching the growth of pet insurance:",
        "Retail and media partnerships",
        "PetPlan made two very bold moves to capture the market opportunity for pet insurance.",
        "PetPlan launched an alliance with Walmart, with the retailer offering its customers PetPlan insurance policies with eligible discounts of up to 10% off of policies. The PetPlan partnership is a key move for Walmart in establishing itself as a cost-efficient destination for pet needs against other retailers given Walmart’s 2019 launch of Walmart PetRx, which provides competitive prices on pet medicine. The brand recognition and channel reach of Walmart provides PetPlan with a formidable opportunity to make back the discounting difference with the sheer volume of policies that could be obtained with Walmart’s level of customer access. The back-end processes for customer service, including claims management, will be fully handled by PetPlan.PetPlan will be rebranded as “Fetch by The Dodo” in Spring 2021 as part of a strategic investment by Group Nine Media, which manages animal-friendly content brand ‘The Dodo.’ PetPlan is capitalizing on a brand followed by 90 million across social platforms while Group Nine broadens beyond its traditional revenue stream of advertising.",
        "Open enrollment and employer plans",
        "MetLife purchased PetFirst in late 2019; prior to the acquisition, PetFirst launched employer group rate offerings. The MetLife acquisition supercharged PetFirst’s potential, shifting it from a profitable $11 million standalone company in 2019 to projecting a 2x increase in the number of pets insured and policy holders on the books from summer 2020 to summer 2021. Considerable growth is expected to be driven with employer enrollment periods of which MetLife has a major footprint in companies across the U.S.",
        "Supplemental worksite insurance provider Aflac also announced a three-year strategic alliance with Trupanion in late October 2020, with Aflac purchasing approximately 10% of Trupanion for $200 million. The initial focus of the integration will be on Aflac’s work-site program, with a forward view towards direct-to-consumer engagement on Aflac’s website. There’s also speculation about the potential expansion of Trupanion into Japan, where Aflac is present in one out of every four households.",
        "Simplifying veterinarian experiences",
        "Zoetis, an animal pharmaceutical company, launched Pumpkin Insurance Services. Pumpkin is a licensed insurance agency that sells a care insurance plan for cats and dogs along with a non-insurance benefit add-on, Pumpkin’s Preventive Essentials, which provides discounts on 12-month supplies of Zoetis medicine. Zoetis hired Alexandre Douzet, who previously founded and managed direct-to-consumer pet food startup Ollie, to serve as CEO of Pumpkin. Improving awareness of pet insurance with veterinarians is a key aspect of Pumpkin’s growth plan and the Zoetis / Pumpkin joint effort provides a hybrid of medical and financial wellness.",
        "Some insurance providers are utilizing the higher adoption of telehealth as a means of making access to veterinarians easier. Figo Pet offers “Live Vet 24/7” access, in which a policyholder can chat with a veterinarian from the Figo Pet mobile app to receive a prescription and medical guidance. Account management, including customer service and claims, can be managed from within the Figo Pet mobile app.",
        "Looking forward",
        "Pet insurance has a long road ahead and how financial firms can build a book of business in this arena will depend on how the market makes it simpler, easier, and faster to insure. It will be interesting to see how consumer spending aligns with the uptake of pet insurance in the coming years. The increase in adoption of dogs and cats that has occurred throughout the pandemic is leading to a rise in spend on pet items for the 2020 holiday shopping season. A Deloitte survey indicates that those who stated they will be buying pet items will be spending an average of $90 on pet food and supplies this shopping season.",
        "Marketers at insurers should keenly observe and monitor if the notable increase in pet toy purchases is the first major step toward increased purchasing of animal wellness packages and growth of pet insurance premiums."
    ]
}