{
    "url": "https://www.acoustic.com/blog/retail-for-good-sustainability-is-the-only-way-forward",
    "title": "Retail for good: sustainability is the only way forward",
    "date": "Nov 20, 2020",
    "author": {
        "name": "Melissa Tatoris",
        "job": "Chief Innovation Catalyst",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/f97d/f97d24f4-f68f-4d2b-8144-837fd38ecb22.jpeg?resize=220px%3A293px&crop=220%3A220%3B0%2C37"
    },
    "content": [
        "Sustainability must be a fundamental element of all retailers’ strategies. From the smallest local retailer to the biggest big box store, consumers increasingly expect the brands they support to be thinking about their impact on our environment. Gen Z is driving this shift, even signaling a willingness to pay a premium for goods rooted in sustainability.",
        "Consumers are demanding “greener” brands and more transparency, and brands have to meet these expectations to attract new customers and retain existing ones.",
        "The move away from disposable shopping bags seemed like a major adjustment when it first came into widespread practice—now it’s table-stakes (or was, pre-COVID). Today, there’s unlimited opportunity for how retailers can prove their commitment to protecting our environment. Here are a few related trends:",
        "1. Reusable products",
        "This encompasses a large swath of product categories. The first that comes to mind is products that reuse single-use plastic. This began with reusable shopping bags and has since expanded to reusable straws, to-go cups, produce bags, and more. It goes even further than this, though: brands are buying back their own products so they can reuse the raw materials for new products. IKEA, for example, will buy back furniture from consumers to give the items a “second life” and prevent them from ending up in a landfill.",
        "Reusable products are a testament to the rise of the circular economy, in which the main goal is eliminating waste and promoting the continual use of resources. TerraCycle Loop, for instance, is a program where consumers can buy their favorite products from their favorite brands—but with reusable packaging.",
        "2. Transparency in when, where, and how brands source their goods.",
        "Knowing exactly where their products come from is becoming increasingly important to consumers. Food kicked this trend off (e.g. “buy organic”) but it has expanded to tech, beauty, and fashion. All of these industries inform their customers of where their source materials originate and whether their products adhere to environmental categories such as vegan.",
        "Trader Joe’s is going beyond transparency in its food offerings and will even let customers know where the building materials of their stores come from. I’ve noticed at Trader Joe’s locations that their walls are adorned with messages detailing that they are made of sustainably-sourced wood, often repurposed from other buildings that were being torn down.",
        "3. A focus on energy efficiency and renewables",
        "Getting to carbon neutrality will be heavily dependent on energy. Clean and efficient energy is one of the hottest trends in the sustainability movement. One group, RE100, is a nonprofit membership organization that brands can become a part of by meeting energy efficiency goals. Hundreds of large brands are involved, working to achieve 100% renewable energy—including retailers that also pledge to rely on clean, renewable energy to power their manufacturing and delivery operations.",
        "4. Organically produced and net-negative plastic products",
        "Shoppers that eat organic want to wear organic, too. Products are being made from plastics removed from polluted environments, or completely natural materials. The shoe category is a great example of innovation in this space: Allbirds makes several sustainable shoes and Sperry makes a boat shoe made of recovered plastics from marine environments.",
        "5. Evaluating influence on natural resources",
        "Consider how iconic fashion retail brand Tommy Hilfiger has adjusted its operations. Through its Make It Possible program, the brand is focused on “reducing [its] negative impacts to zero, increasing [its] positive impacts to 100% and improving one million lives in its value chain.” In many ways, this means a complete departure from its long-time processes, like switching from washing denim in water and instead using lasers to wear-down the fabric—ensuring dyes don’t make their way into the water source.",
        "Consumers are taking notice of brands really doing their part. Retailers must continue to implement new and creative methods for reducing their negative environmental and societal footprints.",
        "Connect with me on LinkedIn."
    ]
}