{
    "url": "https://www.acoustic.com/blog/marketers-are-at-an-inflection-point-what-will-it-mean-for-their-2021-plans",
    "title": "Marketers are at an inflection point. What will it mean for their 2021 plans?",
    "date": "Sep 8, 2020",
    "author": {
        "name": "Brenna Fitzgerald",
        "job": "Vice President, Corporate Communications",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/1567/1567fad2-896e-473f-82b4-7adb7c210a9d.jpg?resize=330px%3A220px&crop=220%3A220%3B55%2C0"
    },
    "content": [
        "We’re excited to unveil a new content series from Acoustic’s CMO Norman Guadagno. The Reset—which launches today with the first in a trilogy of ebooks—explores the topic of “marketing execution after the crisis.” ",
        "This excerpt from Customer Expectations best describes what the full text examines: ",
        "“Perhaps when this all began, you started to think about how you would respond as a marketer; what you might have to do differently as an advertiser; how you were going to rearrange your business priorities in the weeks ahead. Weeks, maybe months, of some degree of uncertainty seemed assured. Certainly, this virus was something, like our somewhat dim memories of H1N1 or Ebola, that would be handled and then we would be back to business as usual. Now, as September dawns, we realize that this was not business as usual at all. This crisis is truly something different, something far more fundamental. This is a distinct change, an inflection point, a shift from one time to another. This is The Reset.” ",
        "With both a B.A. and M.A. in psychology, Norman has always viewed marketing challenges first through the lens of human perceptions, motivations, and emotions. Now, he’s relying upon his training in psychology and his related unique perspective to help other marketers navigate the pivot required in a post-COVID world. This will be a marketing planning season unlike any other. ",
        "Read the non-gated ebook and connect with Norman on LinkedIn to share your thoughts on the topic. "
    ]
}