{
    "url": "https://www.acoustic.com/blog/im-holding-out-for-a-hero",
    "title": "I’m holding out for a hero!",
    "date": "Jul 27, 2020",
    "author": {
        "name": "Norman Guadagno",
        "job": "Chief Marketing Officer",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/a0a4/a0a4b668-379e-4cad-a8b7-3764fa9ca8fc.jpg?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "This blog is part of the ongoing series Acoustic: 2020 Marketing Unplugged.",
        "In our last blog post we discussed the fickle nature of today’s physical and cyber platforms. With consumers traveling less in physical spaces, observing social media bans, and vocalizing marketing preferences, marketers must do more than simply set up campaigns. Marketers must act like superheroes. ",
        "Most job descriptions don’t have a cape and shield included, but the danger is still very real. Without vigilance, marketing professionals can find themselves dumping precious media dollars into empty voids or walking their company into a PR nightmare.",
        "Adweek recently reported that 61% of U.S. respondents surveyed on brand trust agree that how well a brand responds to this crisis will have a huge impact on their likelihood to buy that brand in the future.",
        "The question then becomes, how can marketers sense approaching disaster before it hits?",
        "Listen to the town crier",
        "The best thing any marketer can do is stay informed. By setting frequent news alerts to a variety of different sources, marketers can do broad pulse checks on what’s currently trending.",
        "Consumers demand action – fast. The moment a crisis hits, consumers turn to brands to see what actions they will take and what leadership will be demonstrated. According to a 2019 Crisp survey, one in three consumers (34%) expect brands to respond to a crisis within half an hour. An hour after the crisis gets rolling, that number bumps up to 53%.",
        "It is imperative that marketers stay on top of news in order to respond in the timeframe consumers demand. Social media is the epicenter for action. The same survey revealed that 40% of respondents would discuss a major crisis on social media; only 30% said they’d turn to friends and family.",
        "Plans B, C, D, E….",
        "When danger does arise, marketers must be prepared. Before any danger, marketing teams should have a concrete system in place that determines steps for escalation, crisis management, where native ads are placed and how to pause them, and a list of all language currently being used in advertisements.",
        "If spotted early enough, marketers may be able to simply press pause, redirect to a new platform or set of language and carry on as planned.",
        "Preparedness and planning will be the core foundation to wrangling in trouble.",
        "Diversify your sidekicks",
        "If you’re putting something into the ether and it feels wrong, you should always get a gut check. However, make sure you’re diversifying.",
        "If you always ask the same teammate or colleague, you may start sharing the same views. Reach out to broader groups within your organization to see how they feel about a potential advertisement.",
        "Ensure that you are creating a safe space for conversation and critique. If an ad or piece of marketing material rubs part of your community the wrong way, it’s best that you figure that out before that material is extended to consumers.",
        "Making mistakes happens. Just make sure that they’re on the smallest scale possible.",
        "Know where the batcave is",
        "In times of trouble, it’s central to understand where your safe neutral is. By maintaining the core components of authenticity, consistency, and integrity in all your materials, you’ll maintain consumer trust even when you hit a bump in the road.",
        "If you must pause advertisements, knowing where the range is can be key to continuing communications safely. Contacting consumers via your owned website, email marketing campaigns, and company blog is a safe bet in which you have total control.",
        "Ensure that your external communications always link back to those three areas in good times so customers get used to relying on them for your true brand voice.",
        "Honesty is the best policy",
        "If you do run into trouble – and we all have in this world! – it’s best to remember that honesty and transparency are the best policies.",
        "Remember to show empathy and offer a sincere apology if you do mess up. Real heroes know how to apologize.",
        "We’d love to connect to hear your thoughts on this important topic.  Please connect with me on LinkedIn.",
        " "
    ]
}