{
    "url": "https://www.acoustic.com/blog/digital_transformation_in_financial_services_how_marketers_can_strengthen_returns",
    "title": "Digital transformation in financial services: how marketers can strengthen returns",
    "date": "Sep 20, 2020",
    "author": {
        "name": "Vincent Re",
        "job": "Worldwide Financial Services Strategist",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/40eb/40eb80b2-8b90-42be-9f5e-a5c3dd75c3ef.png?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "“Digital transformation” has been a popular term with an evolving definition that has become increasingly more expansive. The term had previously been taken in the context of enabling customer-facing digital commerce, with a fixed time of a certain number of quarters or years to complete. More recently, digital transformation has become a pioneering mindset: a continuous, holistic view of both front and back-end activity to improve speed, service, and experience.",
        "The pandemic has placed immense pressure on making digital transformation the pioneering mindset across institutions. Initiatives that were previously on a six-month-plan or a 2021 goal for financial services brands have become a next-month or, in some cases, next-week necessity. Coronavirus has made it critical to have a digital ecosystem for customers, operations, and human capital if businesses, financial services or otherwise, expect to survive the economic downturn.",
        "Digital expectations in financial services",
        "Many digital functionalities have become baseline expectations, such as checking balances, bill pay, and mobile check deposit. Bank of America observed in its Q2 performance that there were over 1 million new mobile check deposit users (22% of which were baby boomers) and digital sales were 47% of total consumer sales, up from 29% in Q2 2019.  The pandemic has placed digitization projects into much higher priority and faster progress. Deloitte found that a regional US Bank significantly condensed its timeline for an MVP of a digital account opening solutions from six months to only two weeks. Accelerating this type of project is crucial, especially given that 72% of banks already provide a fully digital process for opening checking accounts via website as of August 2020, according to the Digital Banking Report.  It’s crucial online banking and mobile banking apps are top-notch in services offered, user experience, and ease of sign-up.",
        "Fintech disruptors are also raising the bar in seamless digital commerce, causing financial institutions to keep pace with innovation. Robinhood, providing a commission-free, mobile-first experience with investing, jumped from a valuation of $8.3 billion valuation in May to an $11.2 billion valuation in August given its major growth in trading volume. Acorns allocates the round-up difference of a purchase into investment accounts, with cash-back bonuses to increase investment allocation by shopping with key retail partners. Digit is a monthly subscription service that analyzes banking activity and utilizes its algorithms to automatically allocate savings to various goals, with overdraft prevention and overdraft reimbursement if the platform accidentally overdraws. Financial institutions need to identify whether to build, partner, or buy in meeting and exceeding these value-added expectations in digital transformation initiatives.",
        "Marketing’s role in digital transformation",
        "Marketing has a major role in fueling the success of digital transformation initiatives. Some key actions financial services marketers can take to increase project success:",
        "Personalize adoption paths at a channel level",
        "Marketing must be one of the fundamental teams focusing on personalization. Every message must be hyper-relevant to customers’ lives. Help them with their day, offer a product they need, provide functional onboarding of the app to drive self-service — whatever the message is, it must be relevant to them.",
        "Identify which channel an individual customer would be most receptive to investigating a new product or feature. Some customers prefer emails, others prefer a mobile push or SMS. Although an SMS is more expensive than an email, the potential efficiency gained from a new feature adoption can vastly outweigh the SMS cost.",
        "Prioritize transformation relevancy to each customer",
        "Combine channel insights with customer data and interest signals to determine when to send adoption messages. A product / feature launch for AI-driven savings automation would unlikely to be relevant on Day 1 if the customer is in loan forbearance. However, a launch for improved digital self-service in managing the forbearance process would be a relevant message for that customer.",
        "Financial services brands must find ways to leverage customer data and analytics to engage their customers. Otherwise, their customers will be wooed by competitors with the capability to deliver the most relevant customer experiences.",
        "Ensure timely access to impactful insights",
        "Look across ongoing digital transformation projects and identify the most challenging lag points of data that if such gaps were to be reduced, overall adoption campaign success could be notably improved. Significant delays between when customers enter forbearance and when the marketing team is informed could be mitigated by strategic integrations between systems. Determining new segments that would find relevancy with an ongoing launch could be an opportunity to potentially use AI or machine learning to sort through data and reduce the time from weeks to days or hours to gather relevant insights. This could be as simple as asking for a log-in to a specific analytics platform used by another department. ",
        "What’s next for financial services brands?",
        "Work smarter and more efficiently for your customers and provide them with messaging that matters most. Personalize your marketing by analyzing customer data and engaging with them accordingly. Financial services brands have had to accelerate just about every aspect of their operations as a result of COVID-19. Marketing and customer engagement for financial institutions is not only crucial to enabling customers’ success, but also to retaining them so they don’t slip away to a competitor with higher digital functionality.",
        "Get in touch with Acoustic today about how you can accelerate your digital transformation and connect with me on LinkedIn."
    ]
}