{
    "url": "https://www.acoustic.com/blog/three-steps-to-get-more-out-of-your-marketing-database",
    "title": "Three steps to get more out of your marketing database",
    "date": "Jun 8, 2020",
    "author": {
        "name": "Mitch Henyan",
        "job": ""
    },
    "content": [
        "Intelligent and efficient marketing relies on sending the right message, in the right place, at the right time. The key to all this is right in your marketing database. Without that information, you’re just guessing — which is to say, wasting time and money. Up-to-the-minute and accurate data is the foundation all your marketing efforts will be built on. So how can you best obtain and maintain your data?",
        "Segmentation",
        "Step one is to build your list of potential customers. And since not all customers will think and act the same way, step two is to organize your customers and prospects into logical groups.",
        "Contact lists. These will help you consolidate marketing data and define segments with a specific purpose, like people who want a weekly newsletter or have opted into a specific brand. Contact lists also split the data into purposeful segments that contacts can opt into and out of easily, using preference centers.",
        "Behavior-driven segmentation. Incorporating real-time behaviors into your segmentation will help you identify the most important segments. It’s not just customer demographics that matter, but also about what customers do. Did they click on that email link? Did they look at a product on a web page? Did they tweet about your brand or download that whitepaper? Incorporating these types of behaviors in segmentation can help to identify the ideal customer profiles for your goals.",
        "Relational tables. If you’re using relational tables to store information like purchases, then use that with your segmentation: you can easily find out who has made a purchase in the past 30 days. If you’re storing event registrations and attendance, you can find out who registered for an event but didn’t attend. There are practically infinite possibilities when using relational tables.",
        "Scoring. Lead scoring is a very effective B2B concept for identifying contacts who are most likely to convert. However, it’s also effectively monitors B2B engagement. You can use behavior scoring to help drive segmentation — an easy way to consolidate many different behaviors into one segment criteria.",
        "Advanced analytics",
        "Do you use the same tactics forever? Of course not. You look at your accumulating data and analyze those results to see what needs to be fixed and to find new opportunities.",
        "Campaign web tracking. This isn’t going to replace your existing web analytics, but simply enhance it by making the data actionable in real-time and giving you a 360-degree view of the customer. With web tracking turned on, you can also take advantage of clickstreams and conversion tracking. This is an easy way to use a product like Acoustic Campaign to identify if an email campaign leads directly to a conversion, and even store conversion details like cart purchase amount and description.",
        "Custom dashboards. Most analytics tools give you the ability to create custom dashboards. Acoustic Analytics products take that a step further – creating purpose-built dashboards with AI built in. Make sure your dashboard has a goal: you don’t want to clutter it with unnecessary data. Include only the metrics you want to see and use the AI features that are most important to you, like struggle analytics and anomaly detection.",
        "Consolidate analytics. Extend the custom dashboards you’ve created to other channels, like email and social networks. Make sure you use “append strings” for all hyperlinks in your emails to easily integrate your email analytics with your web analytics. Acoustic Campaign makes this simple to implement and even enables you to change the append string at send time.",
        "Data hygiene",
        "Just as you’re being urged to wash your hands regularly, you need to keep your marketing efforts strong and healthy with good data hygiene. The wrong message via the wrong place or at the wrong time might not be just wasting your time and money — it could really annoy a customer, potential customer, or previous customer you’re trying to get back. As you manage and maintain your database, consider these factors:",
        "Identify duplicates. Duplicate data causes several problems in a marketing database: increased database size, increased cost due to increased communications, damaged IP reputation, lack of a unified view of the customer, inaccurate reporting, and of course bad customer experience. Acoustic Campaign has an easy way of identifying duplicates and removing them as databases are merged.",
        "Database of record. You want to identify a single database of record, whether it is the Campaign database or an external database, such as a CRM or DMP. If Campaign is the database of record, make use of the Recipient ID to identify unique records, or identify unique key fields specific to a record, like email address or SMS phone number. If the database of record is external, use the system field CRMID to identify the record.",
        "Remove inactive data. Reengagement campaigns can be very successful and should be utilized regularly. However, you will always have those contacts who are simply done with your brand or products. Identify a length of time to determine your “dead” contacts (12–18 months, for example) who haven’t engaged (email opens or clicks, website visits, etc.) in that time period and remove them from your database.",
        "Consolidate data. Take a close look at the landscape of all your data. Chances are there are multiple databases to service different brands, products, or purposes. The more databases you have, the harder it is to build a single view of the customer. Instead of multiple databases for different brands, try using a single consolidated database and use segmentation tools like Contact Lists to segment the brands.",
        "Data cleansing services. If need be, there are several data cleansing services that can help. These services provide serval operations like de-duping records, merging data, email and phone verification, etc.",
        "Stay legal. There are several new laws governing how consumer data is stored, processed and protected. GDPR and CCPA are two good examples. Understand if those laws apply to your consumer data and put in the necessary tools to support the laws.",
        "Your marketing database is where you start knowing your customers — and where it will succeed or fail. Gather the best marketing data you can, segment it so you know who you’re talking to, analyze the results to see your opportunities, and always keep your data up-to-the minute to avoid wasting time and money."
    ]
}