{
    "url": "https://www.acoustic.com/blog/solving-customer-struggle-by-controlling-the-controllables",
    "title": "Solving customer struggle by controlling the controllables",
    "date": "Apr 14, 2020",
    "author": {
        "name": "Greta Wallgren",
        "job": "Account Director, Acoustic"
    },
    "content": [
        "Register for our on demand webinar to learn how to leverage analytics to solve customers’ new struggles during these unprecedented times.",
        "Over the course of my career, I’ve been part of various large reinventions and transitions. Some successful and some… well, let’s just say I learned an incredible amount. But with each one I gained wisdom and found some common strategies that worked. ",
        "Over the last several years we have all been entrenched in digital transformation. Before the COVID-19 crisis, we all quoted stats like “Over 87% of shoppers begin product searches on digital channels.” The impact that sheltering in place will have on this statistic is predictable, and we can safely assume it will stay over 90% permanently.",
        "This opens up some opportunities to ensure the digital experience your customers are having creates a long-term relationship with the ultimate goal of driving digital adoption amongst previously apprehensive customers.",
        "How do we do this?",
        "Focus on the fundamentals ",
        "Let’s step back and focus on the fundamental reason customers come to the site, which will help us determine the most high-risk areas where they’d struggle. Highest risk is the checkout process for retailers, the application or deposit process for financial institutions, the submit process for education sites, the appointment scheduling for healthcare and clinics. These are the places we assign to our analysts and resources when searching for customer struggles.",
        "“The change in consumer behavior happening is at a scale very few of us have ever witnessed. This is why it’s important to be grounded in what the changes really are.”\n ",
        "We also focus on the key metrics and how they change. To segment your visitors in a strategic way to pinpoint how those changes differ, you might ask yourself the following basic questions:",
        "Who:",
        "Has WHO is coming to your site changed and, therefore, the marketing channels driving site traffic also changed?Are your age or geography demographics changing on the site or in engagement with emails or SMS? WHO are these new visitors? Are repeaters repeating less often? Is cart size larger or smaller by segment of visitors? Is your site seeing the accelerated digital adoption for Boomers other sites are seeing?",
        "What:",
        "Are customers navigating through processes differently on your site? WHAT are the drop offs in the funnel and has that behavior changed? Are they spending more or less time browsing?Have trends in page views or product views changed drastically due to product demand changes? WHAT frustrations are due to out-of-stocks? Have they shifted demand from clothing to household basics?WHAT products are seeing demand shift in either direction? Should you throw away your planned marketing cadence and focus on the new product demand you are seeing? For instance, right now you probably don’t want a picture of toilet paper in your ad, which will only cause backlash and frustration.Which form fields are customers struggling with? WHAT changes can you push to production that will alleviate these struggles?",
        "Why:",
        "WHY are they abandoning? Is there an increase in failures? Is there a connection that failed, like with credit cards or inventory checks or address look-ups? WHY are they struggling? Did they get frustrated when entering in your coupon or promotional codes? Are customers consistently misspelling those codes?",
        "The source of customer struggles can be found within all this data. Search for anomalies in the business metrics. Look for sessions where customers had to repeat actions over and over again. Bring session replays forward to your internal team meetings to show real customer experiences and struggles on the site.",
        "Now you are looking at real data in order to inform decisions. Data-driven decisions for prioritization of site improvements. Data-driven decisions for marketing channel spend changes. And data-driven decisions for where your team spends their time. ",
        "Set your team on course",
        "It is equally as important to give your team something they can control. It will empower them and improve morale overall. Your team is likely made up of people who thrive on solving the problem. So set them up strongly to solve the customer experience issue, diagnose which browser isn’t working properly, or discover the marketing program that drove the highest revenue.",
        "These problem solvers are grappling with an entire world of tough problems. Giving them some things to focus on that are achievable, impactful, and tangible can go a long way. This includes driving insights for all cross-functional teams. Your dev teams, product teams, digital marketers, and executive leadership all have an interest in the data and insights you’re collecting.  ",
        "Shifting energy toward these fundamentals and tangible metrics toward a common goal of driving a better customer experience motivates the entire organization.",
        "As part of our Brilliant Basics series check back in the coming weeks where we’ll also cover HOW you can find struggles and push for resolution. In the meantime, register to watch our webinar, “Using analytics to solve customers’ new struggles,” on demand."
    ]
}