{
    "url": "https://www.acoustic.com/blog/financial-services-marketing",
    "title": "Financial Services Marketing: How to Successfully Launch a New MarTech Partner",
    "date": "Aug 12, 2020",
    "author": {
        "name": "Darryl Bolduc",
        "job": "Worldwide Strategic Services Lead"
    },
    "content": [
        "If your organization is struggling to execute in today’s extremely complex marketing environment, you are not alone. We recognize, though, that while every organization is facing a setback of some kind, each story is unique. In our Acoustic customer ecosystem, each customer has an individual perspective, a personalized reliance on our solutions, varied levels of digital maturity, and differing approaches to their marketing infrastructure and operations.",
        "Our customers in the financial services industry are particularly specialized—and these customers’ marketing complexities shift even within financial services’ subindustries",
        "Major drivers in finance and insurance",
        "In my experience, there are several sets of activities that marketers operating within financial services are most concerned with:",
        "Security and compliance: sensitivity to personally identifiable information (PII), reliance on government oversight and policy shifts (e.g. rates), and concerns about the cloud and cybersecurityMergers and acquisitions: these events drive technology adoption due to the integration of business and customer data setsFraudulent activity and governance: fraud detection, prevention, and mitigation are critical to day-to-day operations within financial servicesDisparate divisions within the same organization: loans are very different from advisory services, credit cards, and traditional banking—for example. All have individual business models, customer relationships, data, strategies, branch locations, and success metrics.",
        "Financial services marketers must enact change through their marketing technology stack in the midst of this cluttered network of priorities, and it’s a challenge to remain strategically focused.",
        "Seeking clarity in the clutter",
        "To help our customers prioritize, we support their Acoustic MarTech implementation by starting with an assessment of the following categories:",
        "Data and architecture. What does the ecosystem look like? How is everything connected currently? How should it be?Strategy and cadence. What is the business’s communications strategy? What is the end game vs. the day-to-day approach?Process and organization. Given the outcome of the above assessment, we determine how our core competencies align with each customer’s individual use case and understand where we need to lean into our partners.Success and metrics. We map Acoustic’s success to how success is defined by the institution overall and its individual lines of businesses.",
        "Data, data, and more data",
        "Typically, banks are brimming with data but often have no way to connect it. Our first task is always to make connection points so that we can integrate data to facilitate campaigns, analyze user activity, and manage content and connected experiences.",
        "This is incredibly detailed in a financial services setting because tagging for digital experiences can be a challenge given PII sensitivity, local market compliance measures around data capture and retainment, working to reach both B2C and B2B audiences given multiple business units under a single umbrella—and more! Continued M&A within financial services is a challenge for marketers but it provides them with the opportunity to enact change and break down the silos by focusing on tech that will empower them to innovate.",
        "Strategy is subjective",
        "The uniqueness theme continues. There’s no one-size-fits-all approach to strategy development. Each customer in the financial services and insurance realm will likely respond to the following questions differently:",
        "How frequently do they communication with their clients? Typically, communications are driven by the products the institution supports, such as a sequence of new card holder messages or a series related to submission of a claim.Do they embrace lifecycle marketing? Within this concept, are they relying upon automation to ensure appropriate content through the buyer’s journey?Is content gated or open? What’s their reasoning for each choice?",
        "These are all good discussions to further strategy and maturity of a marketing solution set. We find, surprisingly, that many companies are often still just sending “calendar-driven” messages and not leaning into the functionality of their MarTech stack.",
        "Strategy is nothing without process",
        "What does a day in the life of a bank marketer look like? What are the projects they want to tackle but never get around to? How can sophisticated marketing automation support both their day-to-day and long-term deliverables? We ask all of these questions and then some before deploying Acoustic within our customers’ businesses.",
        "It’s also important to understand the ecosystem in which financial services marketers be using our tools. Who does what, between the marketing team, its agency, and the company’s tech team? Establishing a clear workflow and delineation of ownership and approvals is absolutely imperative.",
        "What’s the bottom line?",
        "Every implementation must be defined by success metrics from the beginning.",
        "Identifying these criteria is not as simple as a direct dollar value within financial services. Unlike retail, there’s no cart. It’s important to identify how our financial services customers glean value from marketing activities. What key metrics do they report on? Loan apps, fees, visits?",
        "Data-rich dashboards allow us to make connection points, curate journeys, and build customer stories that all align with values. Transactions, mobile usage, and online services are crucial marketing activity inputs—but so are more “traditional” measures such as call-center interactions, appointments, and other legacy-systems activities. Both sets of activities need to inform campaigns, in service of an enabled marketing ecosystem.",
        "Taking the plunge",
        "Our services team partners with financial services customers to ensure that their complex vertical can take advantage of the full breadth of a marketing solution set.",
        "Reach out to me on LinkedIn to discuss."
    ]
}