{
    "url": "https://www.acoustic.com/blog/how-should-your-company-be-using-email-marketing-during-the-covid-19-pandemic",
    "title": "How should your company be using email marketing during the COVID-19 pandemic?",
    "date": "Mar 27, 2020",
    "author": {
        "name": "Loren McDonald",
        "job": "Program Director, Marketing Research",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/52fe/52fece51-1ef9-4bae-b3cb-58e68dc4a78b.jpg?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "In my 20 years working in the email marketing industry, I’ve never seen such a roller coaster approach to companies using email. ",
        "A few weeks ago, many companies were sending out reassuring messages that business was normal but that they were doing extra cleaning of planes, hotels, restaurants, and stores and that their employees were wearing latex gloves to protect the safety of customers. Then came messages focused on refund policies or limited hours, which were followed by an avalanche of “A Message from our CEO” emails that went into detail about a company’s COVID-19 policies.",
        "But now, judging by my email inbox as well as conversations with customers, I’m seeing most businesses take one of three approaches to their current use of email marketing:",
        "COVID-19 centric: These are companies that are communicating primarily about the impact of COVID-19 on their operations and employees as well as things like modified store hours, home delivery options, and switching from events to webinars.Business (almost) as usual: Brands that are still using the email channel pretty much as they always have, but are modifying the content, product and service offerings, tone, and offers to be relevant to immediate customer needs.Temporarily pausing completely: Companies that are in essence closed for business due to lockdown requirements. They might even be digital or online businesses but they cannot fulfill online orders because workers are not permitted to staff distribution centers and warehouses. ",
        "Email marketing today — and the next few months",
        "Following are some examples of how your business should use email marketing in the coming months based on the status of your business operations.",
        "Temporarily closed: These are “non-essential” businesses such as entertainment and sports venues, health clubs, wineries, and many types of retail stores (other than grocery and pharmacies), whose products or services are primarily at physical locations. If your business is fundamentally closed during a lockdown, consider the following:",
        "Provide tips and videos to help customers achieve their goals. \n\tA gym could provide tips on getting started with yoga, stretching, and weightlifting using items from around the house. A clothing retailer might provide tips on what’s comfortable while working from home or help you look professional on those now-daily video conference calls.Concert and sports venues might provide music and sports trivia, top 100 lists, links to statistics, and reviews of new music. \n\tEducate customers on products and services that will be available once you resume normal business operations or that customers may not have taken advantage of. Many health club customers, for example, may not have worked with a personal trainer, signed up for a spinning course, or used the daycare facilities. Educate them and offer special benefits or discounts now.",
        "Open, but digital or limited operations: Examples in this category are restaurants and coffee shops that are now only open for drive-through, takeout, and home delivery. Or, retailers like wine shops where customers can order online for shipping or home delivery, and airlines that remain open but at very reduced schedules. Sample email programs for these companies include:",
        "As I wrote in my recent article, understanding customer struggles has never been more critical, many businesses have customers interacting with your brand in entirely new ways. An in-store customer might buy from your online store for the very first time. Consider creating a two- or three-email onboarding series that includes information on the value of an online account, step-by-step account creation tips, and key value-add features such as ratings and customer reviews, volume discounts, or free shipping offers,.If you have browse and cart abandonment emails set up, tweak them as needed to help customers who might be struggling with an online purchase. If you don’t have these behavior-based emails in place, trigger messages based on which links customers click on in emails but then don’t complete a purchase.Use this as an opportunity to learn more about your customers. Send a message asking subscribers to update their profile or preferences or to complete a short survey on their travel or wine preferences or whether they prefer mountain biking to road biking. Alert customers to special information on your website or mobile app where they can find up-to-date details on product and service availability.Leverage the data you have on customers and target communications specific to their status as a customer or the types of products and services they purchase regularly.",
        "Near-normal operations: This category includes supermarkets, ecommerce stores, and most cloud-based software companies. While there is no such thing as a business operating normally at the moment, many businesses remain open and very active because they are considered essential or they are digital/online businesses that can serve their customers through a remote workforce or over the internet. For these businesses, email communications can include:",
        "Offers focused on solving current customer needs such as home office equipment or webinar-based training from B2B companies.Remind customers to take advantage of existing membership status and benefits such as online shopping lists, special shopping hours for premium customers, or free shipping programs.Alert customers to potential supply issues for high demand products or extra-long call center wait times and provide alternative options.",
        "Even if you can’t provide direct products or services to your customers, you want to stay top of mind and demonstrate the value of your brand. While the content you share today may not generate any immediate revenue, it will help increase customer retention and potentially increase new sales when your customers return to your business in the coming months. Now is not the time to stop communicating and marketing, but rather to step up in new ways that enhance your brand’s value with customers."
    ]
}