{
    "url": "https://www.acoustic.com/blog/consumer-trust",
    "title": "Reset Required: Consumer Trust",
    "date": "Jul 22, 2020",
    "author": {
        "name": "Norman Guadagno",
        "job": "Chief Marketing Officer",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/a0a4/a0a4b668-379e-4cad-a8b7-3764fa9ca8fc.jpg?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "This blog is part of the ongoing series Acoustic: 2020 Marketing Unplugged.",
        "Marketers are learning how to gain customers’ trust back all over again. Prior to COVID-19, marketers were focused on boosting consumer trust. Now, marketers must look at how COVID-19, social justice, and the call to boycott social media platforms have changed their customer base.",
        "A full consumer trust reset is required. Marketers must dig deep to explore both the questions on the top of consumers’ minds and the questions that marketing teams should be exploring on a daily basis.",
        "COVID-19 Reset",
        "COVID-19 changed the way consumers view brands and how their products fit in to daily life. As noted in a Deloitte study, “social and physical interaction are an essential part of the human experience. Mental strain associated with COVID-19–related social distancing has been noted in every affected location.”",
        "Depression and anxiety related to fear of the virus and necessary social isolation measures have roiled the nation. According to The Washington Post, “nearly half of Americans report the coronavirus crisis is harming their mental health. A federal emergency hotline for people in emotional distress registered a more than 1,000 percent increase in April compared with the same time last year.”",
        "Consumers care about what brands are saying. Sensitivity surrounding the public’s emotional wellbeing and using appropriate language is paramount. Brands must communicate and reinforce their sympathy and not simply marketing for profit.",
        "Because of the unparalleled health and safety situation, consumers had to ask themselves important questions. Is this product made in a clean and safe way? Can it be delivered to me in a clean and safe way? Can I gather in this location safely? Is it truly essential?",
        "Marketers can no longer simply promote a product or venue – they must consider consumers’ health and safety, along with the perception of health and safety, in doing so.",
        "Social Justice Reset",
        "Beyond health and safety concerns, customers are also focused on resetting equality globally. Whether motivated by profit or principle, customers must offer more than racial justice rhetoric, writes Janice Gassam at Forbes. “It’s hard to distinguish performative allyship from authentic and genuine intentions that will lead to actual change.”",
        "Authenticity is a key component in trust. While consumers are looking to see if your brand has vocalized support for social justice, they are truly looking to see if the brand has made a commitment to increasing diversity. Consumers are asking, “Are there actions behind these words? Has this brand donated money? Has this company pledged to increase diversity?”",
        "It is not enough for marketers to post a graphic supporting a cause. Marketers must work to show how they are truly acting as agents of change.",
        "For example, ice cream company Ben & Jerry’s became an unexpected hero of the social justice movement. The company released a statement focused on dismantling white supremacy, called upon President Trump to denounce white supremacy groups, and encouraged congress to approve of H.R. 40, which would release funds to study the impacts of slavery. Ben & Jerry’s founders (Ben Cohen and Jerry Greenfield) were also arrested protesting the cause.",
        "Social Media Reset",
        "Even our online realms are not trusted as they once were. Recent weeks have seen national shut downs of TikTok in India and Hong Kong with the U.S. considering similar course, a wide ranging Facebook boycott, and questions about political advertisements on YouTube running alongside white nationalist and Russian propaganda videos.",
        "Bloomberg predicted Facebook boycotts could cost only $250 million in ad sales; the company makes $77 billion in annual revenue. This leaves many consumers wondering if boycotts like these are effective and if companies are doing enough.",
        "The Verge studied the boycott to determine why it isn’t working as successfully as hoped. The diagnosis shares that boycotting advertisers have not made their demands clear or are demanding things that Facebook already does, that the boycott won’t actually hurt Facebook’s bottomline, and that Facebook employees believe this will all blow over.  Many companies participating aren’t getting any more specific about demands and are simply pulling advertising for one month, as opposed to one year. In addition, many companies that have joined the boycott haven’t expressed their reasoning publicly and have simply paused ads. These light actions are not forceful enough to create real change at Facebook.",
        "Marketers can no longer simply press “go” or “stop” on a campaign. Marketers must constantly be aware of what’s happening online and how people are reacting to different platforms.",
        "Marketers Must Ask Themselves",
        "Trust must completely be reset. In a recent post, we noted that consumers are seeking brands they can trust and it is necessary to avoid over promising, exaggerations, or resorting to trickery.",
        "Beyond being in-tune with what consumers are asking of marketers, marketers must ask themselves additional questions. These questions will be further explored as part of our continuing blog series Acoustic: 2020 Marketing Unplugged.",
        "What does my brand stand for?How, where and how much of my media dollars are getting sent?What kind of return do I get?What are the pros and cons to joining boycotts and movements as the progress?Do I have an accurate running list of sites where ads are being placed natively?How do the ad networks that I’m affiliated with work?",
        "We’d love to connect to hear your thoughts on this important topic. Please connect with me on LinkedIn."
    ]
}