{
    "url": "https://www.acoustic.com/blog/three-basic-metrics-that-drive-site-engagement-and-revenue",
    "title": "Three basic metrics that <em>drive site engagement</em> and <em>revenue<em></em></em>",
    "date": "Apr 15, 2020",
    "author": {
        "name": "Keith Meade",
        "job": "Senior Account Director",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/bd62/bd622108-6e22-4964-ab50-45502c18247d.jpg?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "Establishing clear metrics as your marketing barometers can help align your around what’s working well for your customer and your business. We can often get bogged down in channel metrics, specific campaign metrics, and other competing priorities from organizational initiatives which makes it much too easy to lose sight of the key stats than can help baseline performance month after month. These basic metrics, while simple, are critical in helping you easily see how current campaigns, site improvement, or other website changes are impacting performance, whether it’s online revenue or overall engagement.",
        " ",
        "Throughout my career and working with several online businesses, I always fall back on these three basic metrics to deliver the clarity we need.",
        " ",
        "“With each of these metrics in sight, you always have three levers to pull to impact performance and drive optimization.”",
        " ",
        "1. Conversion rate",
        " ",
        "We all know this is the number of unique visitors over transactions, like orders for ecommerce sites or, on non-ecommerce sites, other high-valued actions like requests for information or account sign-ups.",
        " ",
        "Knowing what percentage of your visitors are performing the main action you want them to take is the first step to understanding how your site is doing. And tracking this metric over time helps you establish a baseline, so you know if things are getting better or worse. While there are many different flavors of conversion rates — like check-out funnel conversion rates or conversion rates from paid or search campaigns — but having a grasp of the total picture helps you understand how your whole website’s performing, not just one part of it.",
        " ",
        "Once you establish this baseline you can begin to look deeper across a customer’s full journey to conversion or whatever your desired goal is. As the customer comes in and out of each journey stage, you can see how they engage with your brand and content, enabling you to help customers get to the desired goal faster.",
        " ",
        "2. Average order value",
        " ",
        "This helps answer how valuable the actions of your conversions are. For example, what’s the quality of accounts being created? What’s the quality of leads being generated?",
        " ",
        "Again, there is a temptation to understand how different sources and channels are driving your AOV and it’s great to track that to understand how each channel is performing, but you may be missing critical insights and opportunities without seeing the total picture. For example, your paid search traffic may be outpacing other sources, such as organic, display, or email with a high overall AOV. It may mean that paid search is the best way to reach your consumers, or it could mean you are missing opportunities in other channels.",
        " ",
        "In today’s dynamic digital world, you can get distracted by all the channels our customers use to engage with your brand. What you need to focus on are the different mindsets customers are in when engaging with your channels. Therefore, we can’t say that one channel or source is better than another — it all depends on the type of audience and when they’re ready to convert. Combining the audience view with your AOV enables you to further optimize and personalize programs and campaigns. Additionally, once you have your AOVs, you can quantify failed sales transactions by looking into user behavior across channels and retarget with the right message to improve loyalty.",
        " ",
        "3. Total Unique Visitors",
        " ",
        "This tracks how many unique consumers are reaching your site overall. It’s good to know where your consumers are coming from and what channels are delivering the best and most traffic, but keeping tabs on that overall number helps you know where to focus your attention. Channel traffic can change quickly, so knowing your topline numbers and spotting trends can help you be more proactive and nimble to close traffic gaps when numbers are down.",
        " ",
        "Starting with this basic metric helps you react quickly to unexpected spikes on digital channels. Once a new campaign goes live or a website upgrade is initiated, there may be spikes in visitors for a page that should not have seen a spike, like a customer service page. By responding quickly with the right message, you have a better chance of increasing engagement and event conversions.",
        " ",
        "With each of these metrics in sight, you always have three levers to pull to impact performance and drive optimization. And when combined, they can also help your forecasts. Let’s look at two examples.",
        " ",
        "If today your site has 100,000 unique visitors a month, a 1.5% conversion rate and an AOV of $20, you’re generating total sales of $3 million. (Use this basic formula: Unique Visitors x Conversion Rate X AOV = Total Sales). With those numbers set as a baseline, you can start to see where you can and should focus to optimize.  ",
        " ",
        "Or maybe your industry has a conversion rate benchmark at 2%. How can you improve conversion? Reviewing the customer experience and seeing where they struggle online can help highlight possible check-out best practices that should be implemented. Can you go after a 1.6% conversion rate? That would generate $200,000 in additional revenue.",
        " ",
        "Focusing on these three basic metrics can not only help you keep a pulse on site performance but also provide a path for the next optimization on your roadmap.",
        " "
    ]
}