{
    "url": "https://www.acoustic.com/blog/how-republic-services-found-1-8m-in-value-using-acoustic-experience-analytics",
    "title": "How Republic Services found $1.8M in value using Acoustic Experience Analytics",
    "date": "Oct 14, 2020",
    "author": {
        "name": "Olivia Anderson",
        "job": "Customer Marketing Manager"
    },
    "content": [
        "Problem discovery and solution made easy",
        " ",
        "Customer-obsessed models are hot topics for many teams across countless organizations — marketing, sales, IT, and customer service departments, among others, are all focused on the notion of customer centricity. All of these teams are intent on ensuring that everything their business does benefits the customer first and foremost. The idea is: we sell things customers want and need, so we must communicate to them about matters that are relevant to their lives and not just about things to buy.  ",
        "Acoustic believes strongly in the customer-centric model. Everything must be for the customer, or why else are we in business? We fill gaps in the market, add benefits to existing products, and we create great experiences and products worth paying for. One of our customers Republic Services also believes strongly in the customer-centric model and used Acoustic to deliver an enhanced customer experience better and faster than they previously could.  ",
        "Republic Services is the second-largest recycling and non-hazardous solid waste company in the United States. Recycling over 8.6 million tons of materials with 16,000 trucks in 40 states, and with over 14 million customers, Republic Services generates an annual revenue of over $10 billion.  ",
        "In February 2020, Republic Services uncovered a problem in surveys with their Voice of the Customer (VoC) software. Customers were experiencing a problem with bill pay: they couldn’t set auto-pay, or even make any payments at all. Upon logging in, they were met with an error message with a phone number and then directed to a customer service call center. This issue was the number-one detractor on the company’s digital customer satisfaction score, according to customer surveys.  ",
        "This was a major problem for Republic Services as the login and payment pages are the most visited pages on their website, with over 500,000 and 300,000 visits respectively. They weren’t sure how to solve the problem. They went into their existing analytics tool to search for the issue and couldn’t find anything. They didn’t have a process for finding and measuring payment-error issues. The team didn’t know what to do — they couldn’t measure the scope of the problem, and they knew if they sent it off to IT that it could take months to find the root cause. They needed a fast resolution. ",
        "The only information they had about these complaints was the complaint themselves. There were no names, no addresses, and no account numbers. There was no data that offered insights into who these people were, only that they were experiencing issues logging in and paying their bills. ",
        "What they needed was to witness, first-hand, what was actually happening. ",
        "Acoustic provides the solution ",
        "Acoustic Experience Analytics (Tealeaf) allows users to see actual sessions of every session to the website. Republic Services had integrated their VoC solution with Experience Analytics earlier in 2020— this decision proved prescient as it provided the key to the problem. Acoustic is able to identify users and sessions by a number of metrics, such as IP addresses, zip codes, even free text of a person’s name. The most value when it came to Republic’s issue was TLT SID, a unique identifier Experience Analytics assigns to every session on customers’ websites.  ",
        "Because VoC and Experience Analytics were integrated, Republic Services was able to match the TLT SID of the session with the survey from the VoC survey. Republic Services searched in Experience Analytics for the TLT SID number and voilà, they found the exact session tied to the complaint.  ",
        "In the session replay, they saw exactly what the user experienced. The customer attempted to log-in, was met with an error code that included a phone number, attempted a few other sections such as auto-pay and contact us, and was forced to call in to the customer service center to pay their bill.  ",
        "The team at Republic Services was able to go into the web code with the pinpointed error area and uncover the issue. They sent this information to IT to fix. Most importantly, they saved significant time troubleshooting the problem.  ",
        "The value of problem-solving, quantified ",
        "Republic Services uncovered that about 200 customers were experiencing the issue daily. They were able to reduce that down to under 50 per day before eventually getting to zero. They found that over 18,000 customers had experienced the issue since the beginning of the year. With a $100 average account value, they calculated that they couldn’t collect over $1.8 million in revenue because of the issue.  ",
        "But the problem was even more nuanced than just revenue that they weren’t collecting or were collecting at a later date. Because of Experience Analytics, they reduced call center traffic by 20% in just three months. IT saved about four hours per QA and developer because they were able to troubleshoot this through Experience Analytics.  ",
        "It worked so well, Republic Services encouraged and experienced widespread and increased Acoustic usage across Marketing and IT.  ",
        "While this problem and solution were specific to Republic Services, that doesn’t mean the same approach can’t be applied to your brand. With Experience Analytics’ session replay capabilities, you can revisit exactly what went wrong and understand the user’s attempts to fix it, where they went, and what they experienced. A true customer-centric approach is to build that layer of empathy into your data. Not just surveys, not just marketing data, not just customer calls, but seeing through their eyes. To solve the problem, you often have to “walk” in their shoes.  ",
        "Take it from Republic Services Kirk V, Marketing Manager of Digital Analytics at Republic Services, who said Experience Analytics is an “essential tool in our MarCom tech stack enabling us to understand our customers better.”   ",
        "For more information on Republic Services’ solution to the problem, watch our joint presentation from Forrester’s CX event. To read Republic Services’ full review of Experience Analytics on G2, click here. "
    ]
}