{
    "url": "https://www.acoustic.com/blog/the-first-scent-of-holiday",
    "title": "The first scent of holiday",
    "date": "Oct 20, 2020",
    "author": {
        "name": "Melissa Tatoris",
        "job": "Chief Innovation Catalyst",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/f97d/f97d24f4-f68f-4d2b-8144-837fd38ecb22.jpeg?resize=220px%3A293px&crop=220%3A220%3B0%2C37"
    },
    "content": [
        "I was minding my own business, enjoying a night of indulgence in “good for the soul” TV—switching channels between Bravo and The Food Network—when I saw it.",
        "A fragrance ad!",
        "The date was October 6th. As a former marketing executive at leading retailers—one of which is a major beauty retailer—I know that fragrance advertising signifies the real beginning of the holiday marketing season. Fragrance is one of the number-one gift-giving items, consistently. Fragrance is an easy gift to buy, and consumers traditionally prefer to not buy their own fragrance. Instead they ask for a replenishment of their favorite fragrance for the holidays.",
        "Typically, fragrance doesn’t launch until later in October, so I was very surprised to see a fragrance ad so early in the month.",
        "The holidays are coming earlier in-store, too",
        "Fragrance advertising isn’t the only indicator of an early holiday season this year. Typically, retailers wait for November 1 (post Halloween) to switch major displays and to start selling specialty items in store. That’s because consumers have complained that retailers are rushing the holiday process. They want to savor the Halloween holiday, and ease into the Thanksgiving holiday before holiday gift-buying launches. Starbucks, for example, has become famous for switching over to red cups during the first week of November—and the shift has become another indicator that the holidays are truly upon us.",
        "This year, holiday has come early in store as well. I walked into my local Homegoods in Dallas last week, and holiday décor and gift items were out in force.",
        "The multichannel shuffle",
        "I have a lot of empathy for retailers right now that are likely reconfiguring their ad buys. I’m curious if we’ll start to see holiday TV spots earlier than 8 weeks prior to Christmas (let me know if you see any on-air!), and if digital will be the platform of choice as it’s hard to predict print relevance as external factors continue to evolve due to the pandemic.",
        "What’s driving the shift?",
        "So much of marketing is driven purely by human emotion, which is why we need to be so in-tune with consumer behavior. My thoughts on why retailers are pushing early? The data must be telling them that:",
        "COVID-19 has driven people into a place where they just want to celebrate something. People are looking forward to having something to look forward to.People are being more thoughtful with gifts because they have more time on their hands. We may even see a lot of handmade gifts vs store-bought; I predict a really strong season for DIY retailers.When people are quarantined to their homes, and seeing the same things every day, they might want to “switch it up.” They may not want to buy a whole new set of home décor, but they can augment their home with new pieces, or create specialty environments for the holidays. I identify with this. My husband and I decided that the day after Halloween, we’re putting our Christmas trees up. We want the feeling of holiday, the comfort, and the feeling of family. The consistency of holiday, in appearance at least, signifies a return to “normalcy.”Think delivery & shop early. If you are buying online vs. visiting a store, most likely everyone else is as well; however, delivery companies are going to get maxed out with the throughput of packages. Pay attention to early sales.",
        "What else can retailers expect given the unique climate surrounding this holiday period?",
        "I predict that:",
        "Electronics will have a huge spike—whether that’s for practical reasons (remote learning and work from home) or due to more at-home leisure (e.g. let’s spend the money we would have spent going out to eat on that new big screen TV we’ve always wanted). We live in a extraordinary world and tech gadgets are going to be at the top of the list.Toys will continue to experience heightened interest and demand. Kids have really had to put up with a lot during the pandemic, and parents who can may want to create even more unique and special experiences for their children this holiday season.“Ready-to-wear” work-from-home apparel will be hot items. Comfy business casual items will remain in-demand as office closures continue indefinitely in many parts of the world.Retailers that offer a subscription model should widely promote it. It will be the gift that keeps on giving month after month – creating a special treat for consumers to look forward to.",
        "The retailers that follow the data and create personalized experiences are the ones who will win",
        "Retailers will never make up the losses they’ve experienced from Q1-Q3 2020; but they are going to do all they can to improve share-of-wallet during the holiday season. Early holiday activity means that retailers can quickly lean into data insights to “make the sale.” The really smart retailers will use the data (what people are looking at on websites, how they’re pre-shopping by putting things on wish lists, or starring them) to create personalized promotions, discounts, and targeted messaging.Retailers must start now. Collect, learn and use all customer interactions regardless of the channel to drive the most growth. I just bought an item on a well-known retailer’s site last week. It arrived on Saturday and on Sunday I realized I bought a size too big. I used their chat bot after I processed the return to see if I could get the smaller size. Unfortunately, they were out of stock; however, the chat bot didn’t offer to send me an email when it became back in stock. Nor did the chat bot offer me another dress or something else on my wish list. This was a missed opportunity to take a brand entry point, that traditionally is a cost center, into a revenue-driving center. Pay attention retailers: there is a lot of low-hanging fruit to help your brand have a bountiful holiday season.Price promotion will be key. Low-price leaders giving big offers are going to win. Look at unemployment rates by zip code; be sensitive to those who might be suffering and consider regional and localized pricing.Get your mobile strategy moving. That last mile, when you can pick up curbside, or where your delivery is will be critical across categories.Leaning into loyalty programs by doing short-term points promotions will compel consumers to act.Retailers should be fully cross-channel with their communications and should use SMS to stand out to their core, engaged audiences. Mobile strategy, generally, is paramount—ensure your customers have curbside or delivery options.",
        "I’m personally feeling excited and enthusiastic about the early pivot to holiday this year. Retailers have an opportunity to spur sales earlier which will help them forecast for 2021 (which is another “wild card” from a planning perspective) through test-and-learn approaches.",
        "I’d love to hear from retailers who are in the middle of holiday campaigns right now. Please connect with me on LinkedIn."
    ]
}