{
    "url": "https://www.acoustic.com/blog/customer_communication_in_a_covid_era",
    "title": "Customer communication in a COVID era",
    "date": "Mar 17, 2020",
    "author": {
        "name": "Loren McDonald",
        "job": "Program Director, Marketing Research",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/52fe/52fece51-1ef9-4bae-b3cb-58e68dc4a78b.jpg?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "As the coronavirus (COVID-19) continues to grow in severity in countries throughout the world, it’s vital that brands and their marketing teams are adequately prepared to proactively and properly communicate to customers and the public.",
        "In many cities and states/provinces, governments have taken steps to ban gatherings of over 50 or even 10 people and have asked businesses like restaurants and bars to close due to COVID-19.",
        "Under these circumstances, getting the tone of communications from your company right is critical to ensure that you don’t damage your brand reputation, while also keeping customers updated on how they can interact with your business.",
        "We’re navigating these unprecedented events ourselves at Acoustic. To help our customers and brands think through how to communicate during these challenging times, we wanted to share a simple guide to help companies plan and execute potential future COVID-19 communications.",
        "1. Assess existing automated/pre-scheduled communications and advertising: Have your internal teams and agencies across all communications channels review content such as automated or pre-scheduled emails, mobile communications, social posts, and advertisements. Check to make sure content doesn’t come off as tone deaf during this period or irrelevant.",
        "In some cases you might simply need to pause a triggered email for a few months, but in other cases changing copy and creative might be in order. Have at least a few different people review content and if in doubt, your best bet is likely to pause or revise content.",
        "Buy-one-get-one-free (BOGO) offers from a restaurant or movie theater chain that’s closed for the next few weeks, while not offensive, just comes off as out of touch. On the other hand, copy in a social advertisement using language such as “Are you feeling sick and tired …” could cause a social media backlash for poorly worded copy.",
        "2. What to communicate and when? If your company has already sent a COVID-19 update to your customers, subscribers, and followers you’ll likely need to provide further updates as new government or company policies change. These might include:",
        "Location closures or hours of operationLimits on customers who can visit a locationChanges in availability of high-demand productsOnline and home delivery optionsRefund and cancellation policiesWhat your company is doing to support workers who might not be able to go to work such as service workersPostponement of events",
        "Since regulations or policies might change over time, anticipate future communications and provide links to your website or include what makes sense in as few messages as possible.",
        "Most importantly, ask how any potential communications can support and convey key issues of concerns to customers — refunds on purchases, business hours, and alternative options to do business.",
        "3. To Whom: A key question companies must address is: Who should we communicate to? The simple answer might be “everyone in our database” but that isn’t likely the best approach.",
        "For example, does a New York City theater need to email past customers who live in California and went to one play 7 years ago that your venue is closed for the next month? If you’re a retailer and an email subscriber hasn’t made a purchase in 5 years or hasn’t opened an email in more than 2 years, does it make sense to add another COVID-19 email to their inbox?",
        "The answer may not be black and white, but put yourself in the mindset of these customers and subscribers and ask if they’re really expecting to hear from you? For those customers, maybe it’s more appropriate to put a notice on your website, blog, or social channels.",
        "On the flip side, if you’re an airline or hotel chain with active loyalty program members, these frequent travelers should potentially receive more personalized messaging and content that explains how you might be going above and beyond to meet their needs. ",
        "Finally, if you’re a national restaurant chain, as an example, you might have locations that are closed in some markets but staying open in others. Or you might have drive-through or home delivery available in some but not all markets. ",
        "Make sure your customer database has the information you need to communicate accurately to people based on where they live or work or the types of products or services they might use. If you don’t have the necessary data about your customers, then be sure that your communications have links and resources where customers can find out about hours, availability, etc. in their local markets.",
        "4. Which channels to use? In general, brands should use all of the channels available to them and not just rely on the most convenient. Email communications, for example, might only be read by one-fourth to one-third of your customers and many of your customers may not be email subscribers or perhaps prefer to just use your mobile app. In addition to email, channels to consider include:",
        "Website: Add a special notice to your home site with a link to a special page or blog with updates. Blog: If your company has a blog, this is a perfect vehicle for COVID-19 updates. And your blog posts can easily be updated, changing or adding dates. Active blogs often are search-engine friendly and might rank well for appropriate searches related to your brand and COVID-19.Mobile: If your company has a mobile app, consider using both simply push and inbox push messages to alert your customers to key information about changes in your service and policies. Account Managers: If you’re a B2B company, an email from the CEO, general manager, or other executive makes perfect sense, but your clients might also want to be reassured by their day-to-day sales/account manager or customer success manager. Webinars: For businesses that have local stores, franchises, partners, dealers, and field staff, an email from the corporate office will probably fall short. Consider conducting online presentations that reassure your channel partners or field locations that provide tips and content for how they should best communicate to their customers and prospects.Social media: Your social channels are an efficient means to communicate to customers and the market, but they can also quickly get out of control and comments from angry people can take on a life of their own. Again, monitor any paid or organic campaigns you have running but also ensure that you have highly experienced staffers monitoring and communicating via your social channels.In-store signage: If your business is open, use all means within your location like TV monitors, leaflets, and pop-signage to communicate important COVID-19-related policies and information.In-app/In-software: If you’re a software company, consider deploying messages to users when they log in to your application.Call-centers: If you have a call center, wait times are very likely incredibly long (my wife was told to call back in 72 hours when calling one hotel chain). Direct callers on hold to an FAQ on your website (preferably with a very simple URL) that can likely answer the most common customer questions.",
        "5. Who does the message come from? In a sampling of my and several co-workers’ email inboxes, a majority of COVID-19 email messages are coming from the CEO. While this likely makes sense in most cases, it might be more appropriate to have the message come from a local or regional manager or account manager in B2B cases. Use your best judgement but depending on the specific nature of a communication, the head of customer or client service, or regional executive might be more appropriate than the CEO.",
        "6. Find the right tone: Almost every business on the planet is being greatly affected by the spread of coronavirus. Airlines, concert venues, industry conferences, and restaurants are being devastated by millions of people no longer traveling or going out to venues. Many jobs and businesses are in peril, but now is not the time for business leaders to show anger or challenge policies and restrictions from local or regional governments.",
        "It is also not the time for your messaging to read like the legalese often found in privacy policies. Now more than ever is the time to be “human” with your content. Your messages should show empathy for your customers and employees safety and well being, and not plead for patronage or be overly promotional.",
        "Yes, all businesses need to continue to generate revenue however possible in this challenging environment, but it’s important to ensure a balance of empathy and sales. If your sales people, for example, are going to continue with prospecting communications it should be in a way that’s offering to provide companies value in navigating unprecedented times. In essence “We’re here to help you, not sell to you.”",
        "7. Listen! Monitor inbound messages: Many companies use “Do not reply” as the “from” name in transactional emails or may not actively monitor replies to emails or social posts. While your internal teams are undoubtedly extra busy right now, listening to customers needs to be a priority.",
        "Make sure you have a process and someone assigned to actively monitor and respond to email replies, social media comments, direct messages, blog and community comments, and discussions. To save time and ensure a consistent and proper response, consider creating a simple FAQ that staff can leverage and then personalize in response to customers."
    ]
}