{
    "url": "https://www.acoustic.com/blog/benchmarking-insurance-distribution-strategies",
    "title": "Benchmarking insurance distribution strategies",
    "date": "Dec 21, 2020",
    "author": {
        "name": "Vincent Re",
        "job": "Worldwide Financial Services Strategist",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/40eb/40eb80b2-8b90-42be-9f5e-a5c3dd75c3ef.png?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "Analyzing customer experience innovation by emerging and established insurers",
        " ",
        "Recent posts have highlighted how insurers are improving efficiencies in specific verticals, such as improving auto claims management with mobile phones, winning more home insurance policies by marketing smart devices, and building out the U.S. pet insurance market with strategic partnerships.",
        " ",
        "Now we’re exploring advancements in insurance distribution models. Ongoing tech innovation continues to change how customers buy insurance; insurtech and insurers are establishing some key lessons for the wider market. Companies that can adapt to and exceed customer expectations, whether through direct digital, price comparison website, or agent sales, will write more premiums and build a larger book of business.",
        " ",
        "Direct-to-consumer insurance sales: Lemonade",
        " ",
        "Insurtech company Lemonade has taken the path of greatest disruption, focusing entirely on delivering a completely direct, highly automated insurance experience. Lemonade launched in 2016 and from its launch (when it blogged about its first 48 hours in business as a company focused on renter, condo, and home insurance within New York State), Lemonade has since expanded into many states across America. It IPOed in Summer 2020 and even launched a pet insurance product.",
        " ",
        "Lemonade openly showcases its relentless focus on speed and the ease-of-use of its insurance offerings, with AI-powered experiences core to execution. A video on its homepage highlights how AI bot Maya assists applicants in getting insured in as little as 90 seconds and how AI bot Jim can help file and approve a claim in 3 minutes. The digital experiences are mobile native, mobile centric, and mobile-optimized, providing some clever user experience efficiencies such as the ability to record a testimonial for submitting a claim.",
        " ",
        "The S-1 filed prior to the IPO discusses the challenges ahead for Lemonade as the company advances beyond insurance for first-time renters to the established and bundle-capable offerings that can be provided by major well-known brands in the U.S. Alan Tsen at Fintech Radar identifies that the data-centricity origin of Lemonade as a competitive advantage, as such a foundation can also assist in expanding gross margin upon determining product-market fit. ",
        " ",
        "Price comparison websites sales: Direct Line Group",
        " ",
        "Direct Line Group has made impressive moves in exploring price comparison websites as a means of fueling business growth. The genesis of Direct Line Group in the mid 1980s established the telephone as the primary means of interacting with the insurance company, avoiding the usage of intermediaries and providing a direct relationship to the customer, hence the ‘Direct Line’ of Direct Line Group.",
        " ",
        "In 2019, Direct Line Group launched Darwin Insurance, a new brand that wins customers searching on price comparison websites and can price to an individual’s needs. Darwin Insurance is an entirely public cloud-native brand, providing the company with the agility to quickly test concepts. The company can then replicate and scale successful attempts across the wider Direct Line Group. ",
        " ",
        "2020 financial reports by Direct Line Group highlight that this approach is starting to show returns. The Direct Line Group 1H 2020 Analyst Presentation identifies price comparison websites as the main approach for profitable growth and its most substantial market for new business. The Q3 2020 Earnings Announcement also highlights that auto and home insurance business has rebounded from the Spring performance, with much of the growth provided from price comparison website shopping. ",
        "Agent sales: Travelers and Aon/CoverWallet",
        " ",
        "Insurers and insurtech companies are augmenting the personal touch of agents with end-to-end digital experiences that accelerate sales cycles and increase productivity.",
        " ",
        "Travelers made major investments in quoting speed for agents. Claudiu Coltea, SVP and Head of Customer Experience, shared that the insurer had been encountering operational challenges that were sometimes taking up to ten days to generate a quote for an agent to share with a prospective customer. A minimal viable product was built within four weeks to improve digital quoting. It launched and soon scaled a fully digital experience for agents and brokers. ",
        " ",
        "Quote requests at Travelers can now be completed in less than one business day, a major productivity improvement from pre-pandemic. Travelers also enables the digital quote to be directly sent to the prospect’s mobile phone, as highlighted by Michael Klein, EVP and President, Personal Insurance, on the company’s Q3 earnings call. ",
        " ",
        "Aon also made a strategic move by closing on an acquisition in January 2020 to augment the agent digital experience by acquiring insurtech CoverWallet. CoverWallet enables agents with an end-to-end digital experience for business insurance. Agents can fill out an application within CoverWallet, obtain near-instant business insurance quotes for a number of major carriers, and finalize the purchase all within the platform. Aon states in its Q3 2020 earnings report that CoverWallet saw a 3x increase in year-to-date premium volume and that CoverWallet is growing 6% per year in a $200 billion market that has less than 5% transacting digitally.",
        " ",
        "What do these advancements mean for insurance marketers?",
        " ",
        "Speed and simplicity are essential investments in the digital insurance experience. Customer expectation benchmarks continue to rise on flexibility. Insurance companies should continue to identify notable friction points – whether front-end experiences or back-end processes – and prioritize resolution to unlock greater premium possibilities.",
        " ",
        " "
    ]
}