{
    "url": "https://www.acoustic.com/blog/distributed-banking-optimizing-channels-for-loan-growth",
    "title": "Distributed Banking: Optimizing Channels for Loan Growth",
    "date": "Feb 23, 2021",
    "author": {
        "name": "Vincent Re",
        "job": "Worldwide Financial Services Strategist",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/40eb/40eb80b2-8b90-42be-9f5e-a5c3dd75c3ef.png?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "Recent fintech disruptors have opened new distribution channels for offering loans to customers. Companies founded in the smartphone era are reshaping how applicants can obtain small loans and how a first-time home buyer can be approved for a mortgage. Extensive manual processes to approve a loan that can stretch for weeks can now be simplified into minutes by utilizing cloud-based automation.",
        "Loan innovation is similar to the evolution of in-flight entertainment systems. Some airlines, particularly low-cost carriers, opted out of providing seatback in-flight entertainment. Implementation, maintenance, and fuel costs of seatback monitors and A/V cables escalate when multiplied across an entire fleet. The smartphone and tablet era enabled airlines to innovate with in-flight WiFi, leapfrogging into streaming entertainment with a bring-your-own-device model.",
        "The opportunity of distributed banking for loans, both for banks with substantial and limited budgets for digital transformation, enables institutions to unlock new approaches to financial performance. Banks that embrace the distributed model for loan growth and concurrently make strategic choices to enhance the direct experience for loan processing will be in formidable positions to achieve financial targets.",
        "Improving small loan application efficiency",
        "Fintech startups are taking new approaches to the processing and approval of small personal loans. Upstart is disrupting the small loans market by utilizing artificial intelligence to broaden risk analysis beyond FICO scores, with loans applied and approved for on Upstart’s website, with loan origination provided by bank partners.",
        "According to a December 2019 Upstart survey, 80% of Americans have never defaulted, and yet only 48% have access to prime credit.",
        "AI modeling has enabled Upstart to issue higher volume of loans at more competitive rates with lower default rates. The Upstart S-1 filing showcases how the company has expanded risk modeling from 23 variables when launching loans in 2014 to over 1,600 variables in 2020, including macroeconomic factors, cost of living, and digital signals. Data from ongoing repayment events assist in managing risk to improve many aspects of the loan process, including fee optimization, income and identity fraud, prepayment and time-limited default prediction.",
        "AI utilization has also enabled greater automation. Across the first three quarters of 2020, 65.6% of its loan applications were approved and fully automated, requiring no direct human involvement. Upstart targets small to mid-market banks, of which each can provide its own loan parameters, and currently has ten bank partners as of September 30, 2020, including Cross River Bank, First Federal Bank of Kansas City, and Apple Bank for Savings.",
        "Enabling fully digital mortgages",
        "The home-buying process typically involves many manual procedures that can add significant time to transactions. Better is disrupting housing loans with a fully digital process on its website that can simplifying initial loan estimates from 3 days to 3 minutes. Two key advantages that Better provides as a distribution channel for banks: its disciplined focus on driving digital cost efficiencies and providing a wider access to customers that have a high preference for digital-first engagement. ",
        "There can be a significant differential between the direct vs. distributed cost of processing a mortgage. Banks incur direct costs that add up throughout the term of originating a loan, from staff and commissions to technology and processes. Better reduces the overall cost for a bank to originate a loan as Better digitizes the steps across the mortgage process and eliminates multiple fees. Better expanded its deal volume from $1 billion in 2019 to $6 billion in 2020 as the pandemic placed greater focus on digital possibilities for obtaining a mortgage.",
        "Better has a network of over 25 of the world’s largest mortgage investors, including banks, investment funds, and Fannie Mae. Better’s broader reach compared to traditional lenders, coupled with Better’s continuous improvements in automations, enables Better to provide a formidable channel for distributed banking. End customers obtain greater access to more competitive rates across the mortgage investors and for the mortgage investors to match its parameters to a wider potential pool of customers.",
        "Innovating direct loan engagement",
        "Balancing distribution channel in parallel with improving direct operational productivity will be essential to successful loan performance. The cost differences between direct and indirect loan acquisition are challenging banks to evaluate innovation priorities across business, marketing, operations, and IT teams, to determine how a bank can continuously elevate a customer’s direct banking experience.",
        "Digital specialists have emerged to assist banks in providing ‘out-of-the-box’ capabilities that improve the productivity of direct loan operations. Amount, an Avant spinoff, provides banks with modular services for various financial products, including personal loans and point-of-sale loans. HSBC, TD Bank, BBVA, and Regions Bank are utilizing Amount’s technology, highlighting that even some of the largest banks are sometimes choosing to buy rather than build in-house for direct loan engagement.",
        "Moving forward",
        "Optimizing loan distribution routes will be imperative to financial success. Customers continue to gain greater access to wider financial possibilities with just a few clicks, taps, and types. Banks need to meet these ease-of-commerce expectations – through intermediary partners and through a bank’s direct digital channels – to achieve loan growth targets."
    ]
}