{
    "url": "https://www.acoustic.com/blog/capturing-behaviors-for-hidden-preference-centers",
    "title": "Capturing behaviors for “hidden” preference centers",
    "date": "May 21, 2020",
    "author": {
        "name": "Loren McDonald",
        "job": "Program Director, Marketing Research",
        "imageUrl": "https://content-us-1.content-cms.com/105338e5-04e0-4801-8a1e-856ba29f2e54//dxresources/52fe/52fece51-1ef9-4bae-b3cb-58e68dc4a78b.jpg?resize=220px%3A220px&crop=220%3A220%3B0%2C0"
    },
    "content": [
        "Many marketers love to hate the preference center. They argue that subscribers rarely use them beyond providing the initial required opt-in or registration information.",
        "And it is true. Generally, it takes needing to change their email address or a desire to unsubscribe or reduce the frequency of emails to motivate someone to visit your preference center.",
        "But that doesn’t mean you should simply ignore your preference center or capturing customer profile data. Instead, rethink the concept of a preference center as something that captures what customers do, not just what they say.",
        "In the concept of the “hidden preference center,” data collection goes beyond subscribers providing demographic information and specifying their interests and preferences for newsletters, product categories, frequency, and channel. It incorporates behavioral data that customers generate through web browsing, purchasing, email activity and even offline engagements that tie into subscription data through the email address or other keys.",
        "The hidden preference center is just a way to think differently about all of this customer data you are capturing to deliver a better experience and improve marketing results. Regardless of where it’s captured, it would by synched with your CRM, data warehouse, or customer data platform (CDP) and made actionable with your marketing automation/campaign management solution.",
        "Following are six potential sources of customer data to help you build out their profiles:",
        "Pre-opt-in behavior: Using web tracking code, you can connect a new subscriber’s pre-registration web behavior to their email address and, in essence, fill in some form fields for them based on behavior.",
        "A simple example: You are a travel site and you don’t explicitly ask for travel preferences during newsletter opt-in or you make it an optional field. A prospect visits your website and only shows browsing interest in Alaska cruises, which can then become their default hidden preference until their behavior or preferences show otherwise.",
        "Click behavior: One of the niftiest ways to build out customer profiles and preferences is to capture their click behavior and translate that into an interest. Design your welcome, onboarding, or specific emails to include linked content with a primary purpose being to glean interests or preferences.",
        "A bicycle ecommerce site might include links to different types of content: “A Beginner’s Guide to Mountain Biking” versus “Advanced Maintenance Tips for Triathletes.” Clickers on these links might then be assigned profile and preference status respectively as “mountain bike” and “beginner” versus “triathlete” and “road bike.”",
        "While their click behavior isn’t a guarantee that you’ve correctly identified a subscriber’s interests, it could help you capture a much higher percentage of preferences versus a survey asking them to update their preferences. And beyond learning more about these new subscribers, you’ve created immediate value for them with access to great content.",
        "Browse/site search behavior: If you are a B2C ecommerce site with a browse abandonment program in place, you are already capturing and retargeting site visitors based on specific product pages they’ve visited. If possible, map this behavior to specific interests like the earlier Alaska cruise example.",
        "Purchase behavior: Using purchase behavior can be extremely valuable but also tricky. A customer of an electronics retailer who purchased a computer keyboard isn’t only interested in keyboards, but if the keyboard only works with Apple Mac computers, you might identify this customer as a “Mac” instead of “PC” customer.",
        "Work with your analytics team and predictive tools to understand what types of products and services customers typically buy based on their first purchase. Then create appropriate segments that you can personalize via specific content and offers in your email and mobile messages and site-based targeting.",
        "Channel behavior: Users who opt-in to have their location tracked on your mobile app can indicate by repetitive location visits what cities they live and work in. Customer segments can be created for people who “work in San Jose,” for example, and can be targeted by a restaurant chain for lunch specials at San Jose locations.",
        "Scoring: Assigning lead scoring to subscribers – whether B2B or B2C – helps identify your most valuable customers, those most likely to purchase, or those at risk of leaving. Scoring, a staple of B2B marketing, is also extremely valuable for B2C marketers.",
        "Say you have two customers, both age 28, living in Austin, and mountain bike enthusiasts. So far, they have the same score based on self-reported data, but when you layer behavior data on top, you find one has joined your in-store loyalty program and visits your store at least once per month.",
        "That customer would have a higher contact score and might receive a different stream of email messages from the other biker, who is identical from a demographic and interest perspective.",
        "The next time you and your team get together to discuss making changes to your preference center, consider rethinking your entire approach and move to supplement explicit subscriber preferences with their implicit behaviors.",
        "For more marketing fundamentals, check out the rest of our Brilliant Basics series."
    ]
}